[{"id":1,"headline":"Elderly, Conservatives Spread The Most Fake News During 2016 Election","short_description":"New study finds these Americans shared more false information during Trump's presidential campaign than other demographics."},{"id":2,"headline":"Evangelical Pastor Defends Trump's Border Plan: ‘Heaven Itself Is Gonna Have A Wall'","short_description":"Robert Jeffress cited the Bible on \"Fox & Friends\" to support the president’s plans for a border wall — but not all Christians agree."},{"id":3,"headline":"Progressive Groups Blast Centrist Tilt Of House Democrats’ Campaign Arm","short_description":"Rep. Cheri Bustos’ leadership team at the DCCC is drawn exclusively from the business-friendly New Democrat Coalition."},{"id":4,"headline":"Petition Asks Trump To Merge North And South Dakota Into ‘MegaKota’","short_description":"“How can [it] be called the United States if some of our states are divided in half?” one MegaKota supporter asked."},{"id":5,"headline":"Dems Introduce Bill To Shield Unpaid Federal Workers From Lenders And Landlords","short_description":"They couldn’t go after government workers or contractors who can't pay rent or loans because of the shutdown."},{"id":6,"headline":"Lindsay Lohan’s New Reality Show Is ‘The Apprentice’ Meets ‘Vanderpump Rules’","short_description":"“Beach Club” isn’t a competition, but the actress is anxious to turn it into one."},{"id":7,"headline":"A Scientifically Proven Trick For Remembering Pretty Much Anything","short_description":"This little memory hack is about to make your life a whole lot easier."},{"id":8,"headline":"Republicans Shrug Off Trump Toying With National Emergency For Border Wall","short_description":"Republicans, who used to complain of \"executive overreach,\" are generally squirming but shrugging over Trump’s threats."},{"id":9,"headline":"Roommate Accused Of Stealing $10 Million Lottery Ticket","short_description":"Police say the man replaced the winning scratcher ticket with one he'd altered."},{"id":10,"headline":"President Trump Storms Out Of Wall Negotiation Meeting","short_description":"Trump stormed out over a disagreement about border wall funding and the partial government shutdown."},{"id":11,"headline":"Fox News Guest: Maybe The Government Should Shut Down 'More Often'","short_description":"Former Republican aide Chapin Fay's proposal might not sit well with the 800,000 federal workers waiting to get paid."},{"id":12,"headline":"10 British Crime Shows You Can Watch On Netflix","short_description":"If you just can't get enough of detectives with British accents."},{"id":13,"headline":"Pixar Co-founder John Lasseter Lands New Gig Despite Harassment Allegations","short_description":"The Time’s Up initiative criticized Lasseter’s hiring, arguing that it “endorses and perpetuates a broken system.\""},{"id":14,"headline":"Lawsuit Targets Kentucky’s Harsh Policy For Restoring Ex Felon Voting Rights","short_description":"Kentucky Gov. Matt Bevin (R) has sparingly used his power to allow former felons to regain their right to vote."},{"id":15,"headline":"Tom Steyer Says He Won't Run For President In 2020","short_description":"The billionaire philanthropist will instead focus on his efforts to impeach Donald Trump."},{"id":16,"headline":"Senate Republicans Won’t Fund The Government If It Means Defying Trump","short_description":"They're just not feeling that whole \"coequal branch of government\" thing."},{"id":17,"headline":"Iran Confirms Arrest Of U.S. Navy Veteran Reportedly Jailed Since July","short_description":"It's not clear what crime Michael White is accused of. His mother said he was visiting his Iranian girlfriend when he disappeared."},{"id":18,"headline":"2 Texas Men Charged With Hate Crimes For Using Grindr To Beat, Rob Gay Men","short_description":"Authorities say Daniel Jenkins and Michael Atkinson subjected the men to gay slurs and smeared feces on at least one of them."},{"id":19,"headline":"Liev Schreiber Says He’s Given Up On Trying To Be Cool To His Kids","short_description":"“I’ve accepted the fact that it’s impossible,\" the \"Ray Donovan\" star said."},{"id":20,"headline":"Trump Threw ‘Temper Tantrum’ After Dems Refused Border Wall, Schumer Says","short_description":"The president walked out of a discussion to end the government shutdown Wednesday."},{"id":21,"headline":"Paris' First Nude Restaurant Closes For Lack Of Business","short_description":"O'Naturel will serve its last naked meal on Feb. 16."},{"id":22,"headline":"Rod Rosenstein Resignation Plan Puts New Pressure On William Barr Confirmation","short_description":"There's no concrete plan for the deputy attorney general's departure, but he'll likely leave after the new attorney general is confirmed."},{"id":23,"headline":"Trailer For ‘Little’ Movie Drops, And Twitter Is Already Celebrating","short_description":"In the film co-starring Issa Rae, Regina Hall's character wakes up trapped inside the body of a 13-year-old, played by teen actress Marsai Martin."},{"id":24,"headline":"Lonely George The Tree Snail Has Died, Wiping Out An Entire Species","short_description":"Despite ongoing efforts, Hawaii's remaining land snails also face imminent extinction, wildlife officials said."},{"id":25,"headline":"Homeless Veteran Accused Of GoFundMe Scam With Couple Skips Court Date","short_description":"Johnny Bobbitt Jr. is being sought by police in New Jersey."},{"id":26,"headline":"Melissa McCarthy Says She Was Body-Shamed By Male Critic During ‘Bridesmaids’","short_description":"The actress recalled an interviewer repeatedly asking about her \"tremendous size.\""},{"id":27,"headline":"Lady Gaga’s Feathered Cape Is As Wacky And Wild As It Sounds","short_description":"The singer wore a Ralph Lauren dress bedazzled with 23,000 crystals."},{"id":28,"headline":"I Got Rid Of Half My Wardrobe Using Marie Kondo’s Methods. Here’s What I Learned","short_description":"Seeking clean, finding clarity."},{"id":29,"headline":"N.C. Governor Begs Trump To End Shutdown So State Can Use Hurricane Aid","short_description":"The state's farming economy is in peril as Hurricane Florence relief remains tied up, Gov. Roy Cooper told the president."},{"id":30,"headline":"YouTube’s Cool With Monetized Videos Promoting A Gambling Scam To Kids","short_description":"So long as the sponsored video creators disclose they’re getting paid. ¯\\_(ツ)_/¯"},{"id":31,"headline":"White Supremacist Steve King Gets A Primary Challenger","short_description":"Iowa state Sen. Randy Feenstra will try to unseat the congressman."},{"id":32,"headline":"Josh Brolin Marks 5 Years Of Sobriety With Harrowing Hangover Tale","short_description":"The \"Deadpool 2\" actor spared no detail to reveal the dark side of partying hard."},{"id":33,"headline":"Migrants And Residents React To President Trump’s Border Speech","short_description":"Here’s how migrants and border-area residents reacted to President Donald Trump’s address to the country."},{"id":34,"headline":"Opinion | Trump Is Losing The Shutdown Fight He Started","short_description":"Democrats in Congress are using their power and our bully president has no idea what to do."},{"id":35,"headline":"Proud Boy Allegedly Murders Brother With A Sword Thinking He’s Killing A Lizard","short_description":"Buckey Wolfe was \"severely mentally ill,\" prosecutors in Seattle say."},{"id":36,"headline":"Trump Nominates Andrew Wheeler As Permanent EPA Administrator","short_description":"The former coal lobbyist and longest-serving acting chief in the EPA's history is set to become its 15th administrator."},{"id":37,"headline":"Christmas Tree Causes Praying Mantis Infestation In Virginia Home","short_description":"Yes, Virginia, there are praying mantises in that Christmas tree."},{"id":38,"headline":"R. Kelly Under Investigation Over Claims Made In Lifetime Series: Reports","short_description":"The \"Surviving R. Kelly\" documentary has reportedly sparked a new look into women’s disturbing allegations against the R&B singer."},{"id":39,"headline":"Trump Orders FEMA To Cut Off Aid For California Wildfire Recovery","short_description":"The president said the fire-ravaged state will receive no more money until “they get their act together.”"},{"id":40,"headline":"Seattle Judge Tosses Lawsuit Against Officers Who Fatally Shot Pregnant Woman","short_description":"Charleena Lyles called police to investigate a burglary. She was shot seven times."},{"id":41,"headline":"Rami Malek Watches Nicole Kidman Snub Him At Golden Globes And It’s Too Much","short_description":"It was accidental, but the embarrassed \"Bohemian Rhapsody\" star tells Jimmy Kimmel it was \"very awkward.\""},{"id":42,"headline":"Norwegian Billionaire’s Wife Kidnapped, Ransom Demanded: Police","short_description":"Anne-Elisabeth Falkevik Hagen, wife of real estate investor Tom Hagen, has been missing since Oct. 31."},{"id":43,"headline":"Kamala Harris: The Country Is ‘Absolutely’ Ready For A Woman Of Color President","short_description":"“We need to give the American public more credit,\" the Democratic senator said."},{"id":44,"headline":"Sean Hannity Warns Tax Hikes Would Stop Rich People From Remodeling Homes","short_description":"If Alexandria Ocasio-Cortez gets her way, wealthy people won't even be able to go to restaurants, according to the millionaire radio host."},{"id":45,"headline":"The Disturbing Truth Of What The Gov’t Shutdown Is Doing To Families Like Mine","short_description":"Worrying about how we're going to afford something as simple as toilet paper is NOT a vacation."},{"id":46,"headline":"White House Scrambles To Check Growing GOP Discomfort With Shutdown","short_description":"Trump was to get a personal sense of the concern —and perhaps questions about his strategy — from those in his own party at the U.S. Capitol on Wednesday."},{"id":47,"headline":"Opinion | Trump’s Oval Office Address Revealed The Nation’s Real Emergency","short_description":"The real emergency is not on the southern border but in the White House."},{"id":48,"headline":"Jeff Bezos And Wife, MacKenzie Bezos, Announce Divorce","short_description":"The billionaire executive released a statement on Twitter announcing the couple's split."},{"id":49,"headline":"Why Breastfeeding Guilt Is So Hard To Shake","short_description":"When is it OK to stop breastfeeding? Whenever you need to."},{"id":50,"headline":"Prince William Jokes About Not Forgetting Kate Middleton’s Big Day","short_description":"The Duchess of Cambridge turns 37 on Wednesday."},{"id":51,"headline":"Russian Church Leader: Smartphones Foreshadow The Arrival Of The Antichrist","short_description":"The Russian Orthodox Church's Patriarch Kirill claims the Antichrist is someone who will control humanity through the internet."},{"id":52,"headline":"Meghan Markle’s Brother Invites Duchess To His Wedding, But It’s A Long Shot","short_description":"\"Maybe they can start their new year's off and actually be more family-involved,\" he said about his sister and Prince Harry."},{"id":53,"headline":"Bradley Cooper Makes History With BAFTA Nominations For ‘A Star Is Born’","short_description":"Yorgos Lanthimos’ period piece “The Favourite\" dominated with 12 total nominations."},{"id":54,"headline":"Second Man Charged With Capital Murder In Jazmine Barnes’ Death","short_description":"Larry D. Woodruffe, 24, is believed to have shot the 7-year-old and her mother in a case of mistaken identity."},{"id":55,"headline":"Family Of Woman Raped While In Vegetative State Speaks Out","short_description":"The woman, repeatedly raped while in the care of Phoenix-based Hacienda HealthCare, recently gave birth to a healthy baby."},{"id":56,"headline":"‘Forrest Trump’: President’s Latest Bonkers Typo Sends Twitter Into Tailspin","short_description":"\"Your brain is like a box of chocolates.\""},{"id":57,"headline":"Opinion | Trump’s Oval Office Address Felt Like A Setup","short_description":"Here's what comes next."},{"id":58,"headline":"Kevin Hart Says He’s Done Apologizing For Past Homophobic Jokes: ‘I’m Over That’","short_description":"The comedian stated once and for all that he will not host the Oscars this year."},{"id":59,"headline":"Dr. Bernice Sandler, ‘Godmother Of Title IX,’ Dies At 90","short_description":"Sandler's work led to the creation of Title IX, the federal civil rights law that ensures gender equality in education."},{"id":60,"headline":"Harvey Weinstein’s Criminal Trial Scheduled To Begin In May","short_description":"The Hollywood mogul, taken down by the Me Too movement last year, is charged with rape and sexual assault."},{"id":61,"headline":"I Was Spending 5 Hours A Day On My Instagram Obsession And It Ruined My Life","short_description":"I was petrified that if I didn’t play the Instagram game, I would be a nobody."},{"id":62,"headline":"AP's Fact-Checking Shutdown Tweet Goes Viral For The Wrong Reasons","short_description":"The news agency faced backlash after blaming both Trump and Democrats for the partial government shutdown."},{"id":63,"headline":"Gwyneth Paltrow Gives Thumbs-Up To BDSM Finger Comment","short_description":"The \"Iron Man\" actress and Goop founder had an intriguing response to a woman who found an adventurous new sex partner."},{"id":64,"headline":"TSA Union Issues Warning As Some Officers Quit Amid Shutdown","short_description":"“Every day I’m getting calls from my members about their extreme financial hardships and need for a paycheck,\" one union official said."},{"id":65,"headline":"Former GOP Rep. Roasts Republicans With Classic ‘Monty Python’ Metaphor","short_description":"Former Rep. Charlie Dent of Pennsylvania referenced a hilariously farcical scene to make his point about the government shutdown."},{"id":66,"headline":"Rick Santorum Praised Trump’s ‘Softer Side’ And Twitter Wasn’t Having It","short_description":"\"Yes, because reading a list of the grim details of horrific crimes is the softer side.\""},{"id":67,"headline":"Zero Lawmakers Representing Border Districts Support Trump’s Wall","short_description":"The nine House members representing border districts from California to Texas voted in favor of reopening the government without additional money for the wall."},{"id":68,"headline":"Rod Rosenstein To Leave DOJ Once New Attorney General Confirmed: Reports","short_description":"Rosenstein, who appointed special counsel Robert Mueller, reportedly will depart as soon as next month."},{"id":69,"headline":"Jamie Lee Curtis Skewers ‘Blatant Promotion’ Behind Fiji Water Girl","short_description":"The \"Halloween\" actress tore into the meme-inspiring stunt at the Golden Globes and says companies need to ask permission for product placement."},{"id":70,"headline":"Donald Trump's Televised Address Gets Deeply Unsettling 'Sex Tape Audio' Edit","short_description":"\"He was watching Stormy fold laundry.\""},{"id":71,"headline":"John Legend Reiterates Criticism Of R. Kelly After Photo With Weinstein Surfaces","short_description":"“If y’all wanna cape for R and discount all these women’s stories, just say it.”"},{"id":72,"headline":"CNN's Jim Acosta Burns Donald Trump With Medical Warning Taunt","short_description":"The news network's White House correspondent said Trump recycled rhetoric from his campaign rallies for his Oval Office address."},{"id":73,"headline":"Jay Inslee Pledges To Reject Fossil Fuel Money Ahead Of Climate-Centered 2020 Bid","short_description":"The Washington state governor is preparing to run for the White House on the sole issue of combating human-caused global warming."},{"id":74,"headline":"Trump Gets Highly Inappropriate With Ivanka In ‘Family Guy’ Teaser","short_description":"A cartoon version of the president makes a sexualized comment to his eldest daughter in an upcoming episode of Fox's animated comedy."},{"id":75,"headline":"Don Lemon: ‘Used Car Dealer’ Donald Trump Is Playing You For Suckers","short_description":"“So little of what this president says is true,\" said the CNN host."},{"id":76,"headline":"6 Vaccines You Should Definitely Be Getting As An Adult","short_description":"Sorry everyone, shots aren't just for kids."},{"id":77,"headline":"How To Talk To Your Kids About Masturbation In A Healthy Way","short_description":"Expert-backed guidelines for parents who want to raise kids with a healthy understanding of sex."},{"id":78,"headline":"These Photos Celebrate Another Year Of Kate Middleton’s Stunning Style","short_description":"In honor of her birthday, let's take a look at the Duchess of Cambridge's under-the-radar style this past year."},{"id":79,"headline":"Nutritionists Rank Salad Dressings, And It’s Bad News For Ranch","short_description":"While bottled dressings may be convenient, when it comes to nutrition, you’re probably better off making your own."},{"id":80,"headline":"All The Hot Movies For Winter","short_description":"Jordan Peele's \"Get Out\" follow-up headlines a season that includes Tim Burton, Julianne Moore, Cate Blanchett and Lifetime."},{"id":81,"headline":"'Where Are The Pesos?' Ex-GOP Strategist Steve Schmidt Taunts Trump Over Wall Funding","short_description":"\"There are no pesos.\""},{"id":82,"headline":"30,000 Los Angeles Teachers Are On The Cusp Of Going On Strike","short_description":"Some 600,000 public school students would be impacted by the teacher walkout which, if it occurs, will be the first in the school district in nearly 30 years."},{"id":83,"headline":"Trump made many misleading and false claims during his speech last night.","short_description":"Again, Mexico is not paying for the wall."},{"id":84,"headline":"Ana Navarro Rips ‘Pathologically’ Lying Trump On Border Wall Speech","short_description":"The CNN commentator slammed Trump for \"downright lies to try to make a political point.”"},{"id":85,"headline":"Supreme Court Rules Against Mystery Company With Possible Ties To Mueller Probe","short_description":"The court declined to block a grand jury subpoena against the foreign-owned firm, a reported target of the special counsel probe."},{"id":86,"headline":"Jimmy Kimmel’s Disclaimer For Trump’s Speech Is Utterly On Target","short_description":"\"The following presidential address is a work of fiction.\""},{"id":87,"headline":"James Corden: ‘American Ninja Warrior’ More Patriotic Than Trump’s Speech","short_description":"If you watched the president's address, \"you know it was very bleak, it was dark, punctuated by more than a few sniffles.\""},{"id":88,"headline":"Celebrities Tear Into Trump Over ‘Hitler-Ian’ Border Security Address","short_description":"Cher, Bette Midler, Seth MacFarlane and Mia Farrow were among those to torch Trump."},{"id":89,"headline":"George Conway Trolls Trump’s ‘Mess’ Address With Epic Retweeting Spree","short_description":"Kellyanne Conway's husband retweeted multiple critical messages, including one that read: \"Tonight was sort of a mess for everyone involved.\""},{"id":90,"headline":"State Of Washington Lambastes Trump Administration Plan To Reclassify Nuke Waste","short_description":"The state has objected to a federal proposal to reclassify millions of gallons of radioactive waste as less dangerous."},{"id":91,"headline":"Trump’s Son: Border Wall Is Like A Zoo Fence Protecting You From Animals","short_description":"Critics slammed the president's son over the Instagram message."},{"id":92,"headline":"Kellyanne Conway Shreds Jim Acosta: ‘You’re Such A Smarta**’","short_description":"“A lot of these people don’t like you.”"},{"id":93,"headline":"Driver Lucky To Be Alive After Falling Freeway Sign Crushes Car","short_description":"Australian authorities described the collapse of the massive sign as \"extremely rare.\""},{"id":94,"headline":"Alexandria Ocasio-Cortez Clobbers ICE After Trump Address: We’re Seeing Death","short_description":"“Right now, what we are seeing is the violation of human rights,” the freshman lawmaker told MSNBC's Rachel Maddow."},{"id":95,"headline":"Donald Trump's Border Speech Gets A Savage Instant Fact-Check On Fox News","short_description":"Shepard Smith had some quick corrections for the president."},{"id":96,"headline":"New York Daily News Cover Depicts Tantrum-Throwing Trump","short_description":"The cover comes after Trump doubled down on his demand for $5.7 billion in border wall money to end the partial government shutdown."},{"id":97,"headline":"Colorado’s Jared Polis Sworn In, Making Him America’s First Openly Gay Governor","short_description":"The Democrat vowed to make his state \"work for everyone\" in a Tuesday speech."},{"id":98,"headline":"Bernie Sanders Calls Climate Change ‘Biggest Crisis Of All’ In Fiery Rebuke Of Trump Speech","short_description":"“Mr. President, we don’t need to create artificial crises, we have enough real crises,” the Vermont senator said."},{"id":99,"headline":"Schumer, Pelosi Respond To Trump’s Oval Office Address","short_description":"Senate Minority Leader Chuck Schumer (D-N.Y.) and House Speaker Nancy Pelosi (D-Calif.) responded to President Donald Trump’s Oval Office address, critic..."},{"id":100,"headline":"Pelosi And Schumer Become Instant Memes After Border Wall Speech Rebuttal","short_description":"The House speaker and Senate minority leader delivered a powerful rebuttal to the president, but Twitter users couldn't resist turning them into memes."},{"id":101,"headline":"Illinois Prosecutor Asks Possible Victims Of R. Kelly’s Abuse To Come Forward","short_description":"Cook County State Attorney Kim Foxx said she's spoken with the families of two possible victims, but needs more information to investigate."},{"id":102,"headline":"Colbert Gives Trump’s Border Wall Speech An Uproarious Alternate Ending","short_description":"The \"Late Show\" host imagined that the president's address could go in a very interesting direction."},{"id":103,"headline":"Trump Lambastes Democrats, Spreads Lies In Speech For Border Wall Funding","short_description":"The president addressed the nation from the Oval Office on Tuesday."},{"id":104,"headline":"Trump’s Border Crisis Is A Myth","short_description":"The federal government is shut down for basically no reason."},{"id":105,"headline":"CNN’s Jake Tapper Dissects The ‘Wall Of Lies’ Trump Has Built","short_description":"The president has built a \"wall of misinformation,\" the CNN host said."},{"id":106,"headline":"Senate Democrats Notch Win Amid Shutdown Fight","short_description":"It's a small way to increase pressure on Senate Majority Leader Mitch McConnell to reopen the government."},{"id":107,"headline":"Gavin Newsom Begins Tackling California's Wildfire Problem His Second Day In Office","short_description":"The new California governor announced two executive orders and an interstate partnership aimed at tackling the wildfire crisis."},{"id":108,"headline":"Trump’s Shutdown Could Spark Corruption In Prisons, Airports, Border Crossings","short_description":"Some experts said working without pay could exacerbate corruption and morale problems."},{"id":109,"headline":"Trump Admin. Will Issue February Food Benefits Early, March Benefits... Maybe","short_description":"After March, it looks like food assistance could stop."},{"id":110,"headline":"Ellen Pompeo’s Reaction To Sandra Oh’s Win Is Extra Adorbs","short_description":"\"Grey's Anatomy\" fans predictably freaked out."},{"id":111,"headline":"Opinion | R. Kelly’s Time Is Finally Up","short_description":"Justice for Kelly's victims will be a step toward racial justice, not an impediment to it."},{"id":112,"headline":"Kroger Manager Accused of Racial Profiling After Calling Cops On Black Teens","short_description":"\"I asked him what we did, and he was like, ‘We’ve had problems with people like you before,’” one teen said."},{"id":113,"headline":"Lorena Bobbitt Speaks Out In Jordan Peele's New Docuseries","short_description":"Amazon Prime's \"Lorena\" aims to challenge \"the long-held narrative\" around the notorious 1993 case."},{"id":114,"headline":"Bryan Cranston Defends Playing A Man With Disabilities In New Film ‘Upside’","short_description":"The “Breaking Bad” star granted the issue of representation was “worthy of debate,” so people on Twitter debated."},{"id":115,"headline":"Read Live Updates On Donald Trump's Border Wall Speech","short_description":"The president is expected to address the government shutdown and his demands for a border wall."},{"id":116,"headline":"Video Shows Kentucky Teacher Dragging 9-Year-Old With Autism Through School","short_description":"Trina Abrams is facing criminal charges in connection with the incident, police said."},{"id":117,"headline":"How Two Governors And A Mayor Plan To Plug The Holes In Obamacare","short_description":"Leaders in California, Washington state and New York City want to advance new coverage plans without Uncle Sam -- and in defiance of President Donald Trump."},{"id":118,"headline":"Unions See Pick For House’s Top Trade Job As Test For Democrats In Populist Era","short_description":"\"We are at a crossroads,” according to a labor union official."},{"id":119,"headline":"Giant Fatbergs Are Clogging Sewers","short_description":"Monstrous amounts of fat and trash are blocking sewers around the world."},{"id":120,"headline":"Regina Hall ‘Honored’ To Be First Black Woman To Win Best Actress From NYFCC","short_description":"Both of \"the Reginas\" shared their admiration for one another at the New York Film Critics Circle awards ceremony."},{"id":121,"headline":"Congress Unveils Gun Background Check Bill On Anniversary Of Giffords Shooting","short_description":"The Democratic-led bill would require federal background checks for nearly all firearm transactions, including private sales at gun shows or online."},{"id":122,"headline":"Rashida Tlaib Only Sorry Calling Trump ‘Motherf**ker’ Has Been A ‘Distraction’","short_description":"The freshman congresswoman from Michigan says she \"won’t apologize for being upset or angry” at the Trump administration."},{"id":123,"headline":"Giant 'Fatberg' Measuring 210 Feet Is Clogging Up British Sewer","short_description":"Officials are telling locals, \"Don't feed the fatberg.\""},{"id":124,"headline":"Muslim Woman Was Allegedly Assaulted, Her Hijab Pulled, In Possible Hate Crime","short_description":"Jenan Ayesh, from Oklahoma, said she was slapped and told to “go back to [her] country” last month in Dallas."},{"id":125,"headline":"‘Pose’ Star Billy Porter Vows To ‘Love The Pain Away’ In Heartfelt New Video","short_description":"The Golden Globe-nominated actor and singer wrote the song after the Columbine massacre but believes the sentiment is \"still necessary today.\""},{"id":126,"headline":"Joshua Tree Closes Temporarily Amid Government Shutdown","short_description":"The iconic California park has reportedly fallen to waste during the shutdown."},{"id":127,"headline":"Growing Minority Also Say That They Are, Or Expect To Be, Affected","short_description":"A growing minority also say that they are, or expect to be, affected."},{"id":128,"headline":"Oklahoma Woman Brags About Poaching On Bumble Dating App","short_description":"Her match was a game warden."},{"id":129,"headline":"Chrissy Teigen Shows Off Her ‘Fun’ Stretch Marks And ‘Thigh Hives’ On Vacation","short_description":"It's a very Chrissy move."},{"id":130,"headline":"Sandra Oh Relaxing In PJs, Diamonds After A Whirlwind Weekend Is Our 2019 Energy","short_description":"BIG MOOD RIGHT HERE."},{"id":131,"headline":"Cyntoia Brown Will Go Free. What About The Countless Others Just Like Her?","short_description":"A majority of women in prison are survivors of sexual or physical violence."},{"id":132,"headline":"Gavin McInnes’ Wife Threatens Neighbors Over ‘Hate Has No Home Here’ Signs","short_description":"The Proud Boys founder's newest battleground is his neighborhood; his new enforcer is his wife, Emily McInnes."},{"id":133,"headline":"Health Facility CEO Resigns After Woman In Vegetative State Raped Multiple Times","short_description":"The victim gave birth as police continue to look for who raped her at Hacienda Healthcare in Phoenix."},{"id":134,"headline":"Security Camera Catches Prowling Suspect Licking Doorbell For 3 Hours","short_description":"Police in Salinas, California, identified the doorbell licker, but haven't made an arrest."},{"id":135,"headline":"How Alexandria Ocasio-Cortez Gets Political With Her Style","short_description":"Alexandria Ocasio-Cortez is using her fashion as a tool to spread her message."},{"id":136,"headline":"Networks To Air Pelosi, Schumer Rebuttal To Trump Border Wall Speech","short_description":"CNN, Fox News, ABC, CBS and NBC are all expected to air the Democrats' response."},{"id":137,"headline":"Alexandria Ocasio-Cortez Calls Op-Ed Comparing Her To Sarah Palin ‘Resentful’","short_description":"She tweeted back at a Washington Post column that said she’s “already gotten more publicity than she deserves.”"},{"id":138,"headline":"Freshman Dem Wants Back Pay For Contractors Out Of Work In Shutdown","short_description":"Federal government workers have gotten retroactive pay after previous shutdowns. But contract workers have not."},{"id":139,"headline":"Jimmy Kimmel Breaks Down ‘Bachelor’ Premiere And Predicts Ultimate Winner","short_description":"The talk show host and his wife pick The One for \"26-year-old virgin\" Colton Underwood."},{"id":140,"headline":"Kellyanne Conway On Sarah Sanders’ False Border Claim: ‘Everyone Makes Mistakes’","short_description":"The White House press secretary is far from the only Trump official to make misleading statements about terrorists crossing the southern border."},{"id":141,"headline":"3 Ways The Sports World Could Make Us Feel Better About Watching In 2019","short_description":"My New Year’s resolution is to make sure the sports we love are fair, safe and not racist."},{"id":142,"headline":"Mueller Thinks Paul Manafort Shared Trump Polling Data With Russian Operative","short_description":"The information was accidentally revealed because of poor redactions by Manafort's legal team."},{"id":143,"headline":"U.S. Emissions Spike Undercuts Trump Administration Push For Fossil Fuel Use","short_description":"Officials have justified gutting of climate policies by pointing to declining emissions."},{"id":144,"headline":"Kanye West And Kim Kardashian Reportedly Having A Baby Boy","short_description":"The couple are set to welcome their fourth child via surrogate later this year."},{"id":145,"headline":"Man Charged In California Campground Slaying And 10 Other Shootings","short_description":"Anthony Rauda is responsible for a number of crimes, including the slaying of Tristan Beaudette as he camped with his two young daughters, police said."},{"id":146,"headline":"Meteorologist Fired After Uproar Over Apparent MLK Jr. Slur On Air","short_description":"Jeremy Kappell apologized for what some TV viewers heard, saying he \"spoke too fast ... to the point that I jumbled a couple of words.”"},{"id":147,"headline":"White Supremacist Rep. Steve King To Hold 39 Town Halls","short_description":"The congressman, who likes to meet fascist figures overseas, has come under criticism for being absent in his district."},{"id":148,"headline":"How The Trump Administration Could Keep Food Assistance Going During Shutdown","short_description":"The president hasn't signed a funding bill, but he could decide the poor are entitled to benefits anyway."},{"id":149,"headline":"For Students Of Color At Parkland, More Security Doesn’t Mean More Safety","short_description":"“We don’t necessarily trust police,\" one student said. \"We have a lot of reasons to not trust them.”"},{"id":150,"headline":"GOP Candidate In Disputed North Carolina Election Runs Away From Reporters","short_description":"Mark Harris said he was actually hurrying to watch the college football championship -- not to duck reporters."},{"id":151,"headline":"Yogi Bear Teaches Trump A Lesson In ‘Government Shutdown’","short_description":"The cartoon bear visits the White House on \"The Late Show\" — and he isn't looking for a picnic basket."},{"id":152,"headline":"The Trump Administration’s Ongoing Illegal Immigration Falsehoods","short_description":"Trump is getting the message out that terrorists are crossing the U.S.-Mexico border, but that’s not entirely true."},{"id":153,"headline":"Beyoncé Shops At Target Just Like Us, And The Internet Needs A Moment To Recover","short_description":"OK, ladies, let's get in the checkout line."},{"id":154,"headline":"Kamala Harris Calls Border Wall Crisis An Emergency Of Trump’s Own Creation","short_description":"The senator called the border wall a \"vanity project\" for the president."},{"id":155,"headline":"Gordon Ramsay Touches Sofia Vergara, Makes Inappropriate Comments In Old Clip","short_description":"“No! No touching!” the \"Modern Family\" actress shouts at one point."},{"id":156,"headline":"Regina King Says Work Toward Her Golden Globes Vow For Gender Equity Has Started","short_description":"The \"If Beale Street Could Talk\" actress said she started hearing from people wanting to join her pledge \"as soon as I walked off that stage.\""},{"id":157,"headline":"Bill de Blasio Unveils Plan To Guarantee Health Care For All New Yorkers","short_description":"The plan will serve the city's 600,000 uninsured people, including undocumented immigrants and low-income residents, de Blasio said."},{"id":158,"headline":"Moose Wanders Into Alaska Hospital Like It Owns The Place","short_description":"The animal was there to eat the plants in the lobby, not see a doctor."},{"id":159,"headline":"Teenagers Like Cyntoia Brown Should Never Be Locked Up For Life","short_description":"The clemency granted to Brown, now 30, is a reminder that many Americans are imprisoned for crimes they committed as youths."},{"id":160,"headline":"All The Lies President Trump May Tell During His Address On The Border Wall","short_description":"The president is set to speak from the Oval Office on Tuesday night."},{"id":161,"headline":"Government Shutdown Leaves Federal Workers Struggling To Pay For Food, Medicine","short_description":"One Louisiana contractor is worried he could lose his apartment."},{"id":162,"headline":"New ‘Captain Marvel’ Special Look Trailer Gets Down To Earth","short_description":"Brie Larson's Carol Danvers has to deal with determined Skrulls and a skeptical Nick Fury in the latest preview for the upcoming movie."},{"id":163,"headline":"Late Night Hosts Take On Trump’s Government Shutdown","short_description":"The late-night comedians made fun of President Donald Trump as his partial government shutdown enters its third week."},{"id":164,"headline":"Adorable Dog Responding To Harry Potter Spells Is Pure Magic","short_description":"Remus is a true canine wizard."},{"id":165,"headline":"Ben Whishaw: ‘I Would Like To See More Gay Actors Playing Straight Roles’","short_description":"The star of “A Very English Scandal” believes Hollywood could benefit from an \"even playing field\" for all performers."},{"id":166,"headline":"Pence Tried To Defend Trump’s Lie That Past Presidents Supported A Border Wall","short_description":"All four living former presidents have denied that they ever spoke to Trump about the wall or have made it clear they do not support it."},{"id":167,"headline":"Bill Kristol Calls Donald Trump's Oval Office Address His 'Last Card'","short_description":"The conservative commentator told CNN he expects the president's speech promoting border wall funding to go nowhere."},{"id":168,"headline":"J.K. Rowling Has 1 Piece Of Advice For ‘A**hole’ Twitter Troll","short_description":"A troll who mocked the Harry Potter author's offer of writing tips got some caustic counseling."},{"id":169,"headline":"Judge In Russian Troll Farm Case Fed Up With Defense Attacks On Mueller","short_description":"A recent defense filing uses an \"Animal House\" quote to bash the special counsel."},{"id":170,"headline":"Twitter Users Explode Over Trump Administration’s Mexico Border Terrorists Lie","short_description":"\"Maybe they were rounding up to the nearest 4000?\""},{"id":171,"headline":"Opus Dei Paid Almost $1 Million To Settle Sexual Misconduct Suit Against Popular Priest","short_description":"A woman alleged the Rev. C. John McCloskey groped her repeatedly during Washington counseling sessions."},{"id":172,"headline":"Nina Turner Eviscerates ‘Flat Out Racist’ Trump","short_description":"The former Ohio state senator warned that Trump could \"bring back the colored and white water fountain.\""},{"id":173,"headline":"Someone Recut ‘The Office’ Fire Drill Scene As A Horror, And It’s Frightening","short_description":"\"The Office\" gets a chilling makeover."},{"id":174,"headline":"Facebook Deactivates Page Attacking R. Kelly Accusers","short_description":"The page attempted to smear women who appeared on a docuseries featuring allegations of sexual and emotional abuse against the singer."},{"id":175,"headline":"Bolton Gets No Assurances From Turkey On Safety Of Kurdish Allies In Syria","short_description":"John Bolton will leave Turkey without meeting with President Recep Tayyip Erdogan."},{"id":176,"headline":"Susan Boyle Competes Again On ‘Got Talent’ And You Must See How She Does","short_description":"She performed for Simon Cowell for the first time in a decade and aced \"Wild Horses.\""},{"id":177,"headline":"After A Run Of Tainted Food Scandals, Women In Japan Took Control Of The System","short_description":"\"You cannot just rely on the mechanisms of capitalism.”"},{"id":178,"headline":"‘The Daily Show’ Roasts TV Stations Over R. Kelly Coverage With Bill Cosby Clip","short_description":"Correspondent Roy Wood Jr. has a serious message for news broadcasters."},{"id":179,"headline":"Ambitious New York City Bill Aims To Replace Gas-Fired Power Plants With Renewables","short_description":"By the end of 2019, the city would have to create a plan to phase out some 20 plants, including a notorious polluter in Queens."},{"id":180,"headline":"Amid Shutdown, Federal Contract Worker Launches GoFundMe Page To Pay Rent","short_description":"Julie Burr, a single mom from Missouri, said she turned to the fundraising site to help make ends meet."},{"id":181,"headline":"27 Too-Real Quotes About Giving Birth From Famous Moms","short_description":"Kristen Bell, Pink, Cardi B and more celebrities opened up about labor and delivery."},{"id":182,"headline":"How Alexandria Ocasio-Cortez Makes Political Statements With Fashion","short_description":"The Democrat is among a new class of congresswomen taking the public's obsession with their looks and running with it."},{"id":183,"headline":"What To Do If You're Attracted To Your Therapist","short_description":"Believe it or not, this happens often."},{"id":184,"headline":"Florida Officially Changes Jim Crow-Rooted Felon Disenfranchisement Policy","short_description":"Florida had one of the harshest policies when it came to stripping voting rights from people convicted of felonies. That changes Tuesday."},{"id":185,"headline":"Jimmy Kimmel Sticks It To Trump With Federal Worker Job Scheme","short_description":"The \"Jimmy Kimmel Live!\" host has the perfect response to the ongoing government shutdown."},{"id":186,"headline":"Amazon's Alexa Attempts To Fact-Check Tech Executive During CES Demonstration","short_description":"The digital assistant had its say."},{"id":187,"headline":"Chris Cuomo Warns Trump Supporters: 'He's Playing You For A Sucker'","short_description":"CNN host calls out the president's wall as a \"farce\" and a \"ruse.\""},{"id":188,"headline":"French Author Says Women Over 50 Are ‘Invisible’ To Him","short_description":"Yann Moix's comments about being \"incapable\" of loving women over his own age has sparked furious backlash online."},{"id":189,"headline":"Fox News Legal Analyst Warns Trump Off New Wall Plan: 'He's In Dangerous Waters'","short_description":"Andrew Napolitano says Trump \"can’t spend money and he can’t take property unless the Congress has authorized it.\""},{"id":190,"headline":"Sean Hannity, Geraldo Rivera Cross A Line In Yelling Border Fight","short_description":"\"Stop it! Just stop it!\" Hannity shouts."},{"id":191,"headline":"Don Lemon Challenges Kevin Hart To Come On CNN: 'Are You Scared Of Me?'","short_description":"\"Come on, I’m not going to be mean.”"},{"id":192,"headline":"Snoop Dogg Issues Blistering Message To All ‘Punk Motherf**ker’ Trump Fans","short_description":"In a scathing Instagram video, the rapper also urged federal workers to do one thing about the president."},{"id":193,"headline":"Meyers: Trump’s Like A Stoner Pizza Shop Manager Who Forgot To Open For Business","short_description":"He sounded pretty high, too, talking about the Soviet invasion of Afghanistan."},{"id":194,"headline":"Samuel L. Jackson Has Rashida Tlaib’s Back Over ‘Motherf**ker’ Trump Rally Cry","short_description":"The \"Pulp Fiction\" star praised the Michigan Democrat for her \"clarity of purpose.\""},{"id":195,"headline":"‘Hardball’ Guest Erupts Over ‘Vesuvius’ Of Lies By Lewandowkski On Immigrants","short_description":"The president needs to manufacture a crisis to get his wall built, says conservative pundit Charlie Sykes."},{"id":196,"headline":"U.S. Supreme Court Rejects Exxon’s Bid To Block Climate Change Lawsuit","short_description":"The court has cleared the way for the attorney general of Massachusetts to obtain internal documents from the oil giant about its knowledge of climate change."},{"id":197,"headline":"Ocasio-Cortez Hits Back At Hannity With A Radically Honest Correction","short_description":"The newly minted congresswoman takes on the Fox News host."},{"id":198,"headline":"Here’s How The Government Shutdown Will Affect Your Tax Return","short_description":"“We are committed to ensuring that taxpayers receive their refunds notwithstanding the government shutdown.\""},{"id":199,"headline":"Report: Only 6 Migrants On Terror Watchlist Were Detained On Southern Border","short_description":"There were nearly 7 times more on the Canadian border, NBC reports."},{"id":200,"headline":"Lindsay Lohan’s Dance Moves Bewitch Jimmy Fallon In ‘Bird Box’ Parody","short_description":"It was only a matter of time."},{"id":201,"headline":"Boston Marathon Bombing Survivor ‘Completely Broken’ After Being Struck By Car","short_description":"Adrianne Haslet said that she was \"thrown into the air\" after being hit while crossing the street."},{"id":202,"headline":"No. 2 Clemson Clobbers No. 1 Alabama To Take College Football Title","short_description":"Freshman quarterback Trevor Lawrence made three touchdown passes for the Tigers."},{"id":203,"headline":"Colbert Trolls Trump With An Absolutely Hilarious New Border Wall Prototype","short_description":"The \"Late Show\" host combines two presidential obsessions in one wall."},{"id":204,"headline":"UFC Fighter Polyana Viana Beats Up Alleged Robber, Shows Him Who’s Boss","short_description":"The 26-year-old Brazilian was waiting for an Uber in Rio de Janeiro when the incident occurred."},{"id":205,"headline":"Nation’s Pilots Warn Trump That Shutdown Threatens Air Safety","short_description":"Fewer TSA agents and FAA safety inspectors may put \"passengers and airline crews at risk,\" a pilots union says."},{"id":206,"headline":"Kevin Hart Apologizes Again For Past Homophobic Comments","short_description":"The comedian, who stepped down from hosting the Oscars, made the apology just days after a controversial appearance on “The Ellen Degeneres Show.”"},{"id":207,"headline":"Second Man Found Dead In Home Of Major Democratic Donor Ed Buck","short_description":"The second death at Ed Buck's home, of another black man, is \"suspicious,\" law enforcement said."},{"id":208,"headline":"Trump’s Upcoming Border Visit Inspires Lots Of Snark From Twitter Users","short_description":"One person wondered if the president is going there to pick up that check from Mexico for the wall."},{"id":209,"headline":"All Major Networks To Air Trump’s Address On The Border Wall","short_description":"The address on Tuesday will come in the midst of a partial government shutdown that has stretched into its third week."},{"id":210,"headline":"Master P Blames Parents Of Alleged R. Kelly Victims But ‘Ain’t Judging’ Him","short_description":"“So I don’t know if R. Kelly did it or not,” Master P said. “That ain’t my business.\""},{"id":211,"headline":"Trump In ‘No Hurry’ To Subject Acting Cabinet Chiefs To Senators’ Questions","short_description":"Officials in acting roles, including a trio of industry allies, currently lead several federal agencies. Trump said it allows for “more flexibility.”"},{"id":212,"headline":"Opinion | Jazmine Barnes’ Life Matters","short_description":"When a child is killed in a violent act, it should be abundantly clear that we have a problem in this country"},{"id":213,"headline":"Facebook Pages Used Russian Tactics To Make Democratic Push In Alabama Election","short_description":"Who exactly led the efforts remains unclear, but the funding sources trace back to progressive activists and tech billionaires."},{"id":214,"headline":"Whoopi Goldberg Tells Alexandria Ocasio-Cortez To 'Sit Still' And 'Learn The Job'","short_description":"The 'View' host suggested the rookie representative should give her Democratic predecessors more credit."},{"id":215,"headline":"Millions Of Americans Think They Have Food Allergies — But They’re Wrong","short_description":"But that doesn't mean they're making up their discomfort."},{"id":216,"headline":"College Athlete Jake Bain Reflects On His Coming-Out Journey On 'Ellen'","short_description":"The Indiana State University football player rose to national prominence after opening up about his sexuality in a heartfelt 2017 speech."},{"id":217,"headline":"Here’s Why People Often Get Sick On Vacation","short_description":"Preventing illness is the first step to enjoying your time off."},{"id":218,"headline":"Thomas Markle Says Meghan Markle’s Treatment Of Him Is ‘Incomprehensible’","short_description":"\"Axe murderers kill 19 people and their daughters still come and visit them in prison,\" the Duchess of Sussex's father told The Sun."},{"id":219,"headline":"‘Green Book’ Criticism Is About Holding Hollywood Accountable, Not Finger-Pointing","short_description":"The Peter Farrelly-directed movie is what happens when filmmakers are preoccupied by a story's optics, not its details."},{"id":220,"headline":"Obama Cuddles His Youngest Fan And It’s Really Adorable","short_description":"7-week-old Paisley Edwards met the former president while he was golfing in Hawaii."},{"id":221,"headline":"All 4 Living Former Presidents Contradict Trump Claim They Support Border Wall","short_description":"Trump falsely boasted that “some of them have told me that we should have done it.\""},{"id":222,"headline":"Gavin Newsom Sworn In As California Governor","short_description":"The Democrat used his swearing-in ceremony to fire back at the Trump administration and appeal to the state's conservative block."},{"id":223,"headline":"One Newspaper Doesn’t Want Sen. Bernie Sanders To Run In 2020","short_description":"A Vermont newspaper’s editorial board has published an op-ed laying out all the reasons why Sen. Bernie Sanders (I-VT) shouldn’t run for president."},{"id":224,"headline":"Senate Democrats Play Hardball In Government Shutdown Fight","short_description":"They're hoping to pressure Senate Majority Leader Mitch McConnell into allowing a vote on bills to reopen the government."},{"id":225,"headline":"The Awards Show Host Is Dead","short_description":"Dear 2019 Oscars producers: There is no such thing as a good awards show host. You're better off hiring no one."},{"id":226,"headline":"The Golden Globes Blew A Chance To Signal A Sea Change In Hollywood","short_description":"Praise for the anodyne “Bohemian Rhapsody” and “Green Book” felt completely removed from the night's earlier victories for diversity and representation."},{"id":227,"headline":"Cyntoia Brown’s Life Sentence Commuted","short_description":"Cyntoia Brown’s life sentence has been commuted after years of campaigns championing her freedom."},{"id":228,"headline":"Julia Roberts Celebrated Her Golden Globes Loss In A Fantastic Way","short_description":"The “Homecoming” star and her husband sure know how to flip a seemingly disappointing night."},{"id":229,"headline":"David Beckham Wears Gorgeous Green Eyeshadow On ‘Love’ Magazine Cover","short_description":"It's a bold look for the former soccer star."},{"id":230,"headline":"Jim Parsons Explains Why ‘The Big Bang Theory’ Had To End","short_description":"The star is reportedly the one who pulled the plug on the still-successful show."},{"id":231,"headline":"Michigan Uber Driver Pleads Guilty To Killing 6 Strangers Between Rides","short_description":"“I’ve wanted to do this for quite a while,” Jason Dalton told a judge."},{"id":232,"headline":"Cyntoia Brown Granted Clemency For Tennessee Murder","short_description":"The life sentence for Brown, a victim of child sex trafficking, was \"too harsh,\" the governor said."},{"id":233,"headline":"Lady Gaga Wraps Golden Globes Night... With Fruity Pebbles In Bed","short_description":"The superstar found a colorful way to indulge as her \"A Star Is Born\" loss sparked outcry on Twitter."},{"id":234,"headline":"Chrissy Teigen Shows Support For Women In R. Kelly Doc: ‘F**k R Kelly’","short_description":"The model and author used the hashtag #MuteRKelly, which many have been using in an effort to stop people supporting his music."},{"id":235,"headline":"Kevin Spacey’s Attorneys Enter Not Guilty Plea On Sexual Assault Charges","short_description":"Spacey must stay away from his accuser and his accuser’s family, the judge also ordered."},{"id":236,"headline":"Kansas Lawmaker Says She Left Republican Party To Join ‘Wave Of Common Sense’","short_description":"State Sen. Dinah Sykes said she was sick of having to answer whether she agreed with Trump's \"absurd\" tweets."},{"id":237,"headline":"Macaulay Culkin Hilariously Trolls Brother Kieran At The 2019 Golden Globes","short_description":"Ah, brotherly love."},{"id":238,"headline":"Ex-Texas Teacher Among 2 Americans Reportedly Caught Fighting For ISIS In Syria","short_description":"Warren Christopher Clark previously sent his resume to the Islamic State in hopes of becoming an English teacher, according to reports."},{"id":239,"headline":"Opinion | Trump Declaring A National Emergency Would Be Roberts’ Next Big Test","short_description":"There are growing signs that Chief Justice Roberts is looking to salvage the reputation of the court."},{"id":240,"headline":"Jada Pinkett Smith Asks What She’s Missing After R. Kelly’s Music Sales Surge","short_description":"“I really don’t want to believe that it’s because black girls don’t matter enough,\" the actress says in a video on Twitter."},{"id":241,"headline":"Free Money Lure ‘Tech Bros To Gentrify Our Communities'?","short_description":"Many local and state governments want to expand their workforce by offering student loan help, lower rent or even free land to attract college graduates."},{"id":242,"headline":"New Saudi Arabia Law Requires Women Be Notified If Their Husbands Divorce Them","short_description":"Women will be informed by text message if their husbands file for divorce."},{"id":243,"headline":"Every Detail You Could Possibly Need To Get Lady Gaga’s Golden Globes Look","short_description":"The star's blue gown was stunning, but her icy hair and makeup really completed the look."},{"id":244,"headline":"Liz Cheney Slams Christian Bale For Golden Globes Remarks About Her Father","short_description":"The “Vice” actor thanked Satan for inspiring him in his portrayal of former Vice President Dick Cheney."},{"id":245,"headline":"Drake Kisses, Caresses 17-Year-Old Fan Onstage In Newly Surfaced Video","short_description":"The clip surfaced the day after the \"Surviving R. Kelly\" docuseries premiered."},{"id":246,"headline":"Ruth Bader Ginsburg Misses Oral Arguments For The First Time Following Surgery","short_description":"The Supreme Court associate justice, who had surgery last month, will work from home but still participate in the cases."},{"id":247,"headline":"Melissa McCarthy Brought The Best Snacks To The Golden Globes","short_description":"“Next year, I’m bringing hot dogs,\" the actress said."},{"id":248,"headline":"Jim Carrey Asks Fans To Finish His Trump Cartoon. They Show True Colors.","short_description":"Maybe the actor and his followers should collaborate more often."},{"id":249,"headline":"China Just Made History In Moon Landing. What Will The U.S. Do About It?","short_description":"Trump sees China as a military threat in space."},{"id":250,"headline":"Trump’s National Emergency Threat","short_description":"President Donald Trump reckons he can declare a national emergency to build a border wall without sign off from Congress. But history says otherwise."},{"id":251,"headline":"If One More Dude Hits On Me On This Game, I’m Changing My Pic To A Scary Clown","short_description":"When you’re a woman, even something as seemingly innocuous as playing a word game is a different experience."},{"id":252,"headline":"Why Jameela Jamil Wore Jeans Under Her Dress At The Golden Globes","short_description":"\"The Good Place\" star said she was \"forking cold.\""},{"id":253,"headline":"Thai Police Say They Won’t Deport Saudi Teen Barricaded In Hotel","short_description":"Rahaf Mohammed al-Qunun, 18, says she fears she will be killed if she's returned to her family."},{"id":254,"headline":"Taraji P. Henson Loses Diamond Ring While Waving At Golden Globes","short_description":"Terry Crews helped her find it for a happy Hollywood ending."},{"id":255,"headline":"Denzel Washington Schools Pushy Fan On Photo Etiquette At Golden Globes","short_description":"The actor delivered an award-worthy off-screen rebuke."},{"id":256,"headline":"Voting Rights Will Soon Be Restored To Over 1 Million Former Felons In Florida","short_description":"Starting at midnight on Tuesday, most former felons in the state who have completed the terms of their sentence can register to vote."},{"id":257,"headline":"Netflix Celebrates ‘Killing Eve’ By Telling People To Check Out Hulu","short_description":"Netflix loves \"Killing Eve,\" and they don't care who knows it."},{"id":258,"headline":"As Green New Deal Fight Shifts To 2020, Young Activists Are Hitting The Road","short_description":"The Sunrise Movement's Road to a Green New Deal Tour will make stops in states like Kentucky, Michigan and Pennsylvania."},{"id":259,"headline":"Progressives Will Get Their Debate On Medicare For All ― And Questions Abound","short_description":"Democrats have put the issue on the House's agenda, so now the real scrutiny begins."},{"id":260,"headline":"Winning the top prize all but ensures the film will become an Oscar nominee too.","short_description":"The critically contested movies won top prizes at the Golden Globes, all but ensuring they'll become Oscar nominees, too."},{"id":261,"headline":"Christian Bale’s Accent Is Freaking Out People On Twitter","short_description":"Yep. That's his real voice."},{"id":262,"headline":"1 Year After Misconduct Allegation, Ryan Seacrest Dons Time’s Up Bracelet","short_description":"Last year, the TV host was accused of sexual misconduct then cleared by an E! investigation."},{"id":263,"headline":"POTTY FAIL: Singer’s Gender-Neutral Bathroom Freak-Out Goes Off The Rails","short_description":"Former Pussycat Doll and Trump supporter's question gets the ratio on Twitter."},{"id":264,"headline":"WikiLeaks Sends Out 140 Verboten Statements On Assange That Reporters Can't Write: Report","short_description":"Including that he bleaches his hair, reports Reuters."},{"id":265,"headline":"Gabon Soldiers Take Over State Radio In Apparent Coup Attempt","short_description":"A source close to the government said there were gunshots around the national television station, but that the plotters appeared to be a small group of s..."},{"id":266,"headline":"‘Betrayed’ Factory Boss Turns On Trump, Says Plant May Move To Mexico","short_description":"The president's steel and aluminum tariffs are \"killing\" a Michigan company, its chairman says."},{"id":267,"headline":"Muslim Youth Group Helps Clean National Parks Amid Government Shutdown","short_description":"The president of the Ahmadiyya Muslim Youth Association invited \"all Americans to join us in these parks and others across the nation.\""},{"id":268,"headline":"Patricia Arquette Drops Unplanned F-Bomb At Golden Globes: ‘I’m So Sorry’","short_description":"\"You can’t take it back, can you?\""},{"id":269,"headline":"‘Enough With The Memes’: Schumer Blasts Trump’s Game Of Thrones-Style Tweets","short_description":"“Just quit hurting innocent people and re-open the government,” the Senate minority leader tweeted."},{"id":270,"headline":"Trump Is The Real National Emergency, Harvard Law Prof Says","short_description":"These statutes were not written to \"give a man like Donald Trump the power he's now claiming,\" Lawrence Lessig said."},{"id":271,"headline":"Regina King Issues ‘Time’s Up’ Call To Action","short_description":"Regina King used her Golden Globes acceptance speech to advocate for gender equity in the workplace."},{"id":272,"headline":"Glenn Close Beats Lady Gaga For Best Actress Golden Globe In Surprise Upset","short_description":"Close took home the trophy for her performance in \"The Wife.\""},{"id":273,"headline":"Susan Zirinsky To Take Over From David Rhodes As CBS News President","short_description":"Zirinsky, who has been with CBS News for more than four decades, will be the first woman to lead the division."},{"id":274,"headline":"Fiji Water Girl Steals The Show During Golden Globes Red Carpet","short_description":"She's already become a meme."},{"id":275,"headline":"First ‘Game Of Thrones’ Season 8 Clip Is One Big Sigh Of Relief","short_description":"Spoiler alert: Dany is OK in the final season ... for now."},{"id":276,"headline":"Sandra Oh On Representation At The Golden Globes: “This Moment Is Real”","short_description":"Golden Globes co-host and award winner Sandra Oh gave a speech celebrating the stories of people of color that are finally being told."},{"id":277,"headline":"Alexandria Ocasio-Cortez Says There’s ‘No Question’ About Trump’s Racism","short_description":"\"The president certainly didn't invent racism. But he's certainly given a voice to it,\" the new congresswoman told Anderson Cooper."},{"id":278,"headline":"Regina King Wins Golden Globe, Delivers Vow To Boost Women’s Representation","short_description":"The actress won Best Performance by an Actress in a Supporting Role for \"If Beale Street Could Talk.\""},{"id":279,"headline":"Christian Bale Thanks Satan For Inspiring Cheney Role In Golden Globes Speech","short_description":"The \"Vice\" actor slammed Cheney and Mitch McConnell as \"charisma-free a**holes.\""},{"id":280,"headline":"Chrissy Metz Denies Calling Alison Brie A ‘B***h’ At Golden Globes","short_description":"\"I adore Alison and would never say a bad word about her, or anyone!\" wrote Metz."},{"id":281,"headline":"Carol Burnett Is 'Gobsmacked' At Golden Globes Honor Named After Her","short_description":"The legendary actress said she didn't think TV networks would take a chance on her type of comedy today."},{"id":282,"headline":"Robert De Niro On Trump: He’s ‘A Real Racist’ And White Supremacist","short_description":"In an interview with The Guardian, the actor said that if the president had his way, \"we'd wind up in a very bad state.\""},{"id":283,"headline":"Lindsey Graham Rages Against ‘Radical Left’ Amid Week 3 Of Shutdown","short_description":"“Why would you negotiate with somebody who calls you a racist if you want a wall?” the GOP senator asked."},{"id":284,"headline":"Golden Globes Red Carpet Fashion Statements","short_description":"Take a peek at some of the hottest looks on the Golden Globes red carpet."},{"id":285,"headline":"Sandra Oh Becomes First Asian To Win Golden Globe For Lead Actress In A Drama","short_description":"The \"Killing Eve\" star also hosted the night's ceremony with comedian Andy Samberg."},{"id":286,"headline":"Chicago Bears Lose Heartbreaker After Last-Second Field Goal Hits Crossbar","short_description":"Bears kicker Cody Parkey missed a 43-yard field goal in the final seconds for Chicago as teammates watched in disbelief from the sideline."},{"id":287,"headline":"Emma Stone Yells ‘I’m Sorry’ After ‘Aloha’ Whitewashing Joke At Golden Globes","short_description":"Stone played a character of Hawaiian and Chinese descent in \"Aloha.\""},{"id":288,"headline":"‘Black Panther’ Cast Slays Red Carpet At Golden Globes","short_description":"Actress Danai Gurira's stunning gown was inspired by Zimbabwe’s national flower, the flame lily."},{"id":289,"headline":"Mulvaney Blames Schumer For Apparent Trump Fib That Ex-Presidents Back His Wall","short_description":"\"My guess is that this boils down to some semantic difficulties with Schumer,\" the acting White House chief of staff says of Trump's claim he can't substantiate."},{"id":290,"headline":"Emily Blunt And John Krasinski Look Practically Perfect On The Red Carpet","short_description":"Blunt is nominated for her work in \"Mary Poppins Returns.\""},{"id":291,"headline":"Editorial Board Of Vermont Paper Begs Bernie Sanders Not To Run In 2020","short_description":"\"Bernie Sanders should not run for president. In fact, we beg him not to,\" wrote the Barre Montpelier Times Argus editorial board."},{"id":292,"headline":"Sandra Oh, Andy Samberg Roast Gaga’s ’100 People’ Line, Gaga Yells ‘It’s True’","short_description":"During the opening monologue at the 2019 Golden Globes, the hosts jokes about the \"A Star Is Born\" actress' oft-repeated phrase."},{"id":293,"headline":"Sandra Oh And Andy Samberg Kill Hollywood With Kindness In Golden Globes Opening","short_description":"The self-proclaimed \"nicest people in show business\" intentionally failed at roasting some of the night's biggest stars."},{"id":294,"headline":"Kristen Bell Is A Grecian Goddess At The 2019 Golden Globes","short_description":"The \"Good Place\" star stunned in a blush gown alongside husband Dax Shepard."},{"id":295,"headline":"E! Forks Up Jameela Jamil’s Name At Golden Globes In Nod To ‘Good Place’ Fans","short_description":"This totally would happen to Tahani."},{"id":296,"headline":"Here Are The 2019 Golden Globe Awards Winners","short_description":"The Dick Cheney biopic \"Vice\" and Bradley Cooper's hit romance \"A Star Is Born\" lead the nominations."},{"id":297,"headline":"We’re Off The Deep End For Lady Gaga’s Judy Garland-Inspired Golden Globes Look","short_description":"The Valentino gown channeled a gown worn by Garland in the 1954 iteration of \"A Star Is Born.\""},{"id":298,"headline":"Babysitter Returned Dead Infant To Mom After Disguising Him To Look Asleep","short_description":"The Wisconsin woman faces first-degree murder charges for the death of the 2-month-old."},{"id":299,"headline":"Jamie Lee Curtis Whites Out Golden Globes Red Carpet With Head-To-Toe Look","short_description":"The horror icon shut down the red carpet with some all-white glam."},{"id":300,"headline":"Michelle Yeoh Rocks ‘Crazy Rich Asians’ Emerald Ring At Golden Globes","short_description":"The actress wore an emerald-green gown, too."},{"id":301,"headline":"Sandra Oh’s Adorable Family Shows Their Support Ahead Of Golden Globes","short_description":"The actress' family members wore T-shirts with Oh's iconic quote from the 2018 Emmys, \"It's an honor just to be Asian.\""},{"id":302,"headline":"Rep. Schiff: Trump Can’t Declare An Emergency To Build Border Wall","short_description":"The president doubled down earlier Sunday on his previous threat to use emergency powers if the shutdown continues."},{"id":303,"headline":"2019 Golden Globes: See All The Best-Dressed Celebrities On The Red Carpet","short_description":"Stars brought out the glitz and glamour in full force on Sunday night."},{"id":304,"headline":"Saudi Arabia Fears Critics Like Hasan Minhaj. But They’ll Only Get Louder.","short_description":"The kingdom's decision to ban an episode of Minhaj's Netflix show comes after months of Saudi attacks on the first Muslim U.S. congresswomen."},{"id":305,"headline":"National Park Service To Tap Into Entrance Fees To Keep Operating Amid Shutdown","short_description":"Trump's decision to keep the parks open during the weekslong budget impasse is no longer workable, an official said."},{"id":306,"headline":"Arkansas Sheriff’s Deputy Fired After Shooting Chihuahua During House Call","short_description":"Faulkner County cop Keenan Wallace discharged his service weapon at Reese’s, reportedly shattering the dog’s jaw, during a house call Friday."},{"id":307,"headline":"Death Row Inmate Found Dead In Cell After Execution Halted Twice","short_description":"Scott Dozier, who spent 11 years on death row, had pleaded for his execution, insisting \"life in prison isn't a life.\""},{"id":308,"headline":"Trump: Forget Concrete, Let’s Build A Steel Wall Instead","short_description":"The president seemed to imply the material was the real sticking point as he continued to keep the government partially shut down over wall funding."},{"id":309,"headline":"Her Husband Was Detained In Iran. Now She’s Raising Their Child On Her Own.","short_description":"Xiyue Wang has been gone for two and a half years. He and his wife worry their son will forget about him."},{"id":310,"headline":"Fox News’ Chris Wallace Shreds Sarah Huckabee Sanders Over Border Terror Claims","short_description":"\"I studied up on this,\" Wallace said as he disputed the White House press secretary's claims about terrorists coming into the U.S."},{"id":311,"headline":"Trump: I Can ‘Relate’ To Federal Workers Who Can’t Pay Bills During Shutdown","short_description":"\"Many of those people agree 100 percent with what I'm doing,\" the president, who is a billionaire, said without evidence."},{"id":312,"headline":"Alexandria Ocasio-Cortez Honors Mom With Moving Instagram Post After Swearing In","short_description":"\"So many people sacrificed so much for this to happen,” the 29-year-old New York Democrat wrote."},{"id":313,"headline":"John Bolton Says Certain Conditions Must Be Met Before U.S. Withdraws From Syria","short_description":"President Donald Trump's national security adviser appeared to backpedal on the president's initial promise for an immediate pullout."},{"id":314,"headline":"Opinion | House Democrats Have Wilbur Ross In Their Sights","short_description":"Adding a citizenship question to the census could be one of the Trump administration's most flagrant and consequential scandals."},{"id":315,"headline":"Mick Mulvaney: Shutdown Likely To ‘Drag On A Lot Longer’","short_description":"The acting White House chief of staff said he doesn't see an end in sight for the standoff."},{"id":316,"headline":"Suspect Charged With Capital Murder In Jazmine Barnes Killing In Houston","short_description":"Police say the shooting may have been a case of mistaken identity."},{"id":317,"headline":"Opinion | I Want A Woman President. I’m Not Afraid to Say So Anymore.","short_description":"Watching more women being sworn in to Congress only makes my desire burn brighter."},{"id":318,"headline":"Steve Scalise Feuds With Ocasio-Cortez Over ‘Radical Followers’ On Twitter","short_description":"The tit-for-tat began after Scalise claimed Democrats want to waste taxes on \"leftist fantasy programs.”"},{"id":319,"headline":"Hannity Advises Trump To Carry Shutdown 'Through The State Of The Union'","short_description":"“If they capitulate, the Republicans, the political damage frankly is incalculable.\""},{"id":320,"headline":"Time’s Up Advocates To Debut New Ribbons, Bracelets At Golden Globes","short_description":"The new gear is part of the TIMESUPX2 campaign, a celebration of the initiative’s second year as well as a call for the number of women in leadership rol..."},{"id":321,"headline":"Chief Of Staff To Defense Secretary Resigns 5 Days After James Mattis’ Departure","short_description":"“After two years in the Pentagon, I’ve decided the time is right to return to the private sector.\""},{"id":322,"headline":"Harold Brown, Defense Secretary In Carter Administration, Is Dead At 91","short_description":"Brown led the Pentagon as it modernized weapons and improved communications and intelligence systems."},{"id":323,"headline":"Not So Fast: Trump Called The Chinese Motherfu**kers In Vegas Speech","short_description":"Does this mean Rashida Tlaib is out of the hot seat?"},{"id":324,"headline":"GOP Strategist Calls Ocasio-Cortez ‘The Little Girl.’ She Lets Him Have It.","short_description":"Congresswoman calls Ed Rollins a \"walking argument\" for a 100 percent tax on misogyny."},{"id":325,"headline":"Chance The Rapper Says Recording Song With R. Kelly Was A ‘Mistake’","short_description":"He apologized in a tweet to \"survivors for working with him and for taking this long to speak out.\""},{"id":326,"headline":"Lemon Wants Kevin Hart To Be An ‘Ally’ After Controversial ‘Ellen’ Appearance","short_description":"\"Kevin, if anything, this is the time to hear other people out,\" the CNN anchor said."},{"id":327,"headline":"Trump Calls Those Who Don’t Support His Wall ‘Criminals’","short_description":"\"Everyone\" else wants it \"very badly,\" the president tweeted."},{"id":328,"headline":"Elizabeth Warren Blitzes Iowa With Populist Message","short_description":"The 2020 campaign kicked off in earnest as the Democratic senator made her first visit to the Hawkeye State since announcing her likely bid."},{"id":329,"headline":"Axl Rose Releases First Song In 10 Years — With The Looney Tunes","short_description":"If you can't enjoy this even a little bit, then you might be made of stone. Certainly not ROCK."},{"id":330,"headline":"Shelter Takes In Dog With Heartbreaking Note Saying Owner Couldn’t Feed Her","short_description":"\"Please take care of Sky,\" began the handwritten letter discovered by the Delaware Humane Association."},{"id":331,"headline":"CNN Hits Back After Trump's DHS Denies TSA Workers Are Calling Out Sick Amid Shutdown","short_description":"President Donald Trump and other administration officials, as per usual, called the network \"fake news.\""},{"id":332,"headline":"Former NYT Editor Fires Back At Trump On Paper’s Credibility","short_description":"The president leapt at a Fox News report that quoted the editor's upcoming book."},{"id":333,"headline":"Millions Could Lose Food Assistance If Government Shutdown Continues","short_description":"Does Donald Trump want a border wall badly enough to let struggling Americans go hungry?"},{"id":334,"headline":"Teacher Who Fed Puppy To Turtle In Front Of Students Found Not Guilty","short_description":"Robert Crosland said he believed he was doing the right thing by putting the sick puppy out of its misery."},{"id":335,"headline":"Biden: Rush Limbaugh, ‘Conservative Blonde Woman’ Pushed Trump Towards Shutdown","short_description":"The \"conservative blonde woman\" was likely a reference to Ann Coulter, who called the president gutless for not building the promised border wall."},{"id":336,"headline":"Beyoncé And Solange's Mom Tina Knowles Lawson Joyfully Celebrates Her 65th Birthday","short_description":"“65 and proud of it!!!” the philanthropist wrote on Instagram."},{"id":337,"headline":"Trump Wants To Call The Shutdown A ‘Strike.’ He Has It Completely Backward.","short_description":"If anything, the president should call it a lockout."},{"id":338,"headline":"Police Say Woman Was Attacked By Dog, Then Bitten By Dog’s Owner","short_description":"The victim came away from the incident with injuries from the person, not from the dog."},{"id":339,"headline":"‘Bird Box’ Is A Bad Movie, So Why Do So Many People Like It?","short_description":"The undercooked apocalypse movie is the latest installment in the win-some-lose-some cultural experiment that is Netlix. And in terms on online popularity, it won."},{"id":340,"headline":"What Black People Are Really Saying When They Defend Kevin Hart And R. Kelly","short_description":"When black people come to the defense of these men, here’s what they are really saying: black lives matter, but only certain ones, only convenient ones."},{"id":341,"headline":"Democrat Accuses Nielsen Of ‘Outright Lies’ On Border, Calls For Hearing","short_description":"House Homeland Security Committee head Bennie Thompson wants to look into the Trump administration's border policy and the deaths of two migrant children."},{"id":342,"headline":"Egypt Attempts To Quash Controversial CBS Interview With President Sissi","short_description":"CBS revealed that after the interview was filmed, the Egyptian ambassador contacted its \"60 Minutes\" team and warned that it could not be aired."},{"id":343,"headline":"Ellen DeGeneres’ Kevin Hart ‘Interview’ Is Talk-Show Culture At Its Worst","short_description":"\"Ellen\" should be an ideal place to engage in cultural discourse, but the influential host proved we have no arena for litigating issues as serious as ho..."},{"id":344,"headline":"HuffPost Her Stories: A ‘Spectacular Start To The Year’ For Gender Equality In India","short_description":"Plus: The most emotional moments from a barrier-breaking day in U.S. Congress."},{"id":345,"headline":"What To Watch On Netflix That's New This Week - HuffPost","short_description":"What To Watch On Netflix That's New This Week HuffPost 'Black Mirror: Bandersnatch' Has A Secret, Weird Ending UPROXX The Author From Black Mirror: Bandersnatch Isn’t Real, But Likely Inspired By This Writer POPSUGAR Black Mirror: Bandersnatch - All Of The Be…"},{"id":346,"headline":"What To Watch On Amazon Prime That's New This Week - HuffPost","short_description":"What To Watch On Amazon Prime That's New This Week HuffPost Streamline recommends “Beautiful Boy” on Amazon Prime this week. Amazon added this movie on Jan. 4. The company distributed the movie, which debuted in..."},{"id":347,"headline":"I’ve Only Ever Kept One New Year’s Resolution: Drink More. Here’s Why And How.","short_description":"Four years, and still going strong."},{"id":348,"headline":"Shutdown Talks To Continue As Trump Says It Could Last ‘Months Or Even Years’","short_description":"Trump is framing the weekend talks as progress, while Democrats are emphasizing families unable to pay bills."},{"id":349,"headline":"Trump Makes Wild Boast About ‘Great Support’ For The Border Wall","short_description":"Trump bragged that there was \"great support coming from all sides\" for his campaign promise. But that's not the case."},{"id":350,"headline":"Mitt Romney Will Always Say Whatever He Thinks 51 Percent Of Voters Want To Hear","short_description":"New job, same Mitt."},{"id":351,"headline":"How 2 Student Reporters Exposed One Of The Internet’s Biggest Neo-Nazis","short_description":"Inside the takedown of a prolific white nationalist propagandist."},{"id":352,"headline":"5 Children Dead After Church Van Crashes On Way To Disney World","short_description":"They were among the seven people killed in a fiery crash involving two tractor-trailers traveling in opposite directions in Florida."},{"id":353,"headline":"Coast Guard Member’s Wife: Shutdown Makes Me Consider Returning Son’s Gifts","short_description":"She opened up to CNN's Anderson Cooper about the financial toll the shutdown is taking on her family."},{"id":354,"headline":"MSNBC Trolls Donald Trump With Supercut Of His Most Ridiculous Boasts","short_description":"Trump just can't stop bragging in this montage."},{"id":355,"headline":"Election Chaos Is Making History’s Second-Largest Ebola Outbreak Worse","short_description":"The Democratic Republic of Congo government cut the internet. People attacked medical facilities. NGOs relocated their staff."},{"id":356,"headline":"‘Multiple Victims’ Reported Following California Bowling Alley Shooting","short_description":"Police reported shots being fired at the Gable House Bowl in Torrance."},{"id":357,"headline":"Trump’s Border Wall Could Result In More Child Deaths, Advocates Worry","short_description":"A border wall could force migrant families into more dangerous ways of crossing the border."},{"id":358,"headline":"Mike Pence Aide Imposter Sends Fake Texts To GOP Lawmakers, Sparking FBI Inquiry","short_description":"The messages were reportedly from an imposter claiming to be Pence's press secretary."},{"id":359,"headline":"White House Press Office Inadvertently Suggests Trump Has A Time Machine","short_description":"\"Quick! Someone stop Old Biff from giving him the Sports Almanac!\""},{"id":360,"headline":"‘Escape Room’ Fire Kills 5 Teenage Girls In Poland","short_description":"The blaze broke out at a venue in Koszalin on Friday afternoon."},{"id":361,"headline":"Don Lemon Mocks Trump’s Border Wall Talk: Everything But ‘Moat With Alligators’","short_description":"“Oh my gosh. C’mon y’all. Can we be real?”"},{"id":362,"headline":"CNN's Anderson Cooper Delivers Scorching Fact-Check Of Donald Trump's Shutdown Boast","short_description":"He picked apart Trump's claim that federal workers are fine with not being paid."},{"id":363,"headline":"Jim Carrey Shares Cartoon Theory Of Devolution About Trump Supporters","short_description":"\"Let’s remember this year that according to very sound scientific evidence, human beings evolved from apes and not the other way around.\""},{"id":364,"headline":"Record-Breaking Number Of Americans Want To Get Out Of U.S. Forever","short_description":"The percentage of Americans wanting to jump ship is markedly higher under the Trump administration than it was under his predecessors."},{"id":365,"headline":"Grand Jury Hearing Evidence In Mueller Inquiry Is Extended For Up To 6 Months","short_description":"The investigation lives on."},{"id":366,"headline":"‘I Never Said I’d Build A Concrete’ Wall, Trump Tells Reporter In Testy Face-Off","short_description":"President says CNN journalist  wouldn't understand because she's \"not into the construction business.\""},{"id":367,"headline":"The auctioned-off bluefin tuna weighs 612 pounds.","short_description":"The auctioned-off bluefin tuna weighs 612 pounds."},{"id":368,"headline":"GOP Strategist Slams House Republicans For Looking Like A 1950s Corporate Board","short_description":"Democrats \"look like America and our future,\" tweets a top aide to Mitt Romney's 2012 presidential campaign."},{"id":369,"headline":"Warren’s Debut Trip To Iowa Ignites Voter Passion","short_description":"Elizabeth Warren headed to Iowa on Friday to jump start the 2020 race."},{"id":370,"headline":"Kevin Hart Says He Is Now Considering Hosting The Oscars After Ellen DeGeneres’ Urging","short_description":"The comedian stepped down from hosting the Academy Awards after a series of his homophobic tweets resurfaced."},{"id":371,"headline":"Missouri Teen Left Blind After Mystery Illness Causes Her Eyes To Bleed","short_description":"After losing her eyesight and nearly her life, Jordyn Walker lives with knowing the terrifying symptoms could return."},{"id":372,"headline":"TSA Officers Calling In Sick So They Can Work Paying Jobs, Say Union Officials","short_description":"Numbers \"will get worse\" as the government shutdown \"drags on,\" said a representative."},{"id":373,"headline":"New Governor Mills Makes Fighting Opioid Deaths A Priority In Maine — Finally","short_description":"In her first days in office, the state's first female governor expanded Medicaid and announced plans for an opioid czar."},{"id":374,"headline":"Bennett College, One Of The Last Women’s HBCUs, Could Lose Accreditation Over Money","short_description":"Actor Jussie Smollett and others are pushing a #standwithbennett fundraising campaign to save the North Carolina school."},{"id":375,"headline":"Hilary Duff Gives Rachel McAdams’ Iconic Breast Pump Photo A Relatable Twist","short_description":"The \"Lizzie McGuire\" star recently welcomed a baby daughter."},{"id":376,"headline":"In A Congress Full Of Firsts, Still No Open Atheists","short_description":"Only one member of Congress identifies as \"religiously unaffiliated.” The overwhelming majority say they're Christian."},{"id":377,"headline":"Opinion | Lots Of Us Think Trump Is A Motherf**ker. Rashida Tlaib Just Said It","short_description":"The voice of the people."},{"id":378,"headline":"Trump Repeats False Claim That Trade Deal Results In Mexico Paying For His Wall","short_description":"The president also claimed he can declare a national emergency to bypass Congress and just spend money to build a wall he promised Mexico would pay for."},{"id":379,"headline":"Opinion | Kyrsten Sinema’s Swearing-In Look Was A Bold Queer Statement","short_description":"She's here, she's a femme queer and now she's a senator. Get used to it."},{"id":380,"headline":"Trump Claims Most Furloughed Federal Workers Are Rooting For Him On Wall Funding","short_description":"He doesn't have any evidence to support that claim."},{"id":381,"headline":"‘Saw’ Creator Finally Reacts To Theory That Jigsaw Is Kevin McCallister","short_description":"Director James Wan weighs in on the wild speculation -- and answers some questions about his very unrelated project \"Aquaman.\""},{"id":382,"headline":"'Harry Potter' Fans Can't Believe Wizards Used Poop Magic Back In The Day","short_description":"A long-forgotten factoid that resurfaced on Twitter had Potterheads shook."},{"id":383,"headline":"Death At National Park Unreported For Week Amid Government Shutdown: Report","short_description":"A spokesman for the National Park Service did not comment on whether a lack of staffing impacted how quickly rangers reached the man who fell."},{"id":384,"headline":"Proud Boys’ Gavin McInnes Can Get Back To Antifa After He Battles His Neighbors","short_description":"McInnes is complaining that his neighbors' anti-hate yard signs are an attack on him and his family."},{"id":385,"headline":"Washington Governor To Pardon People With Misdemeanor Marijuana Convictions","short_description":"“We shouldn’t be punishing people for something that is no longer illegal in Washington state,” Gov. Jay Inslee said."},{"id":386,"headline":"Trump Threatens To Keep Government Closed, ‘Prepared’ For Extended Shutdown","short_description":"President Donald Trump has said he’s willing to keep the government closed for “months or even years.”"},{"id":387,"headline":"Here's How You Can Book A Trip For Just $1","short_description":"Book now, pay later."},{"id":388,"headline":"Madonna Has Pretty Great Response To People Wondering If She Got Butt Implants","short_description":"A video of the pop icon performing on New Year's Eve prompted some to talk about her body."},{"id":389,"headline":"Pay-Go Rule Shows Democrats Are Still Playing The GOP's Game","short_description":"It's an unnecessary and misguided impediment to progressive goals."},{"id":390,"headline":"President Who Gleefully Insults People Calls Tlaib’s Comments ‘Disgraceful’","short_description":"Trump acted outraged that he was called a \"motherf**ker\" by an elected official."},{"id":391,"headline":"Supreme Court Agrees To Hear 2 Partisan Gerrymandering Cases","short_description":"The court said it will hear two cases involving challenges to congressional districts in North Carolina and Maryland."},{"id":392,"headline":"Police Investigate After Woman In Vegetative State For Over A Decade Gives Birth","short_description":"Authorities are investigating a possible rape case after it was discovered a patient at the Hacienda HealthCare facility in Phoenix was pregnant."},{"id":393,"headline":"Trump May Declare National Emergency To Build Border Wall","short_description":"The president says he doesn't need congressional approval to build the wall."},{"id":394,"headline":"Neil deGrasse Tyson’s Show On Hiatus During Sexual Misconduct Investigation","short_description":"Celebrity astrophysicist Neil deGrasse Tyson is denying accusations of sexual misconduct."},{"id":395,"headline":"Trump Officials May Get Huge Raises As Federal Workers Go Without Pay","short_description":"Vice President Mike Pence’s salary could rise from $230,700 to $243,500."},{"id":396,"headline":"Why Democrats Left Trump’s Taxes Out Of Their Day 1 Agenda","short_description":"They claim they're being \"reasonable\" and governing more responsibly than Trump himself."},{"id":397,"headline":"Watch A Guy Try To Steal A Bicycle From A Police Station","short_description":"\"Dumb\" is how a Gladstone, Oregon, cop described the attempt after officers arrested the suspect on the spot."},{"id":398,"headline":"Police Identify Suspect Accused Of Killing Nail Salon Worker Over $35 Manicure","short_description":"Authorities are calling on the public to help search for the suspect."},{"id":399,"headline":"'Fox & Friends' Tells Viewers Now Is The Time To 'Buy A Gas Guzzler'","short_description":"Host Steve Doocy suggested we take advantage of low fuel prices."},{"id":400,"headline":"Schumer: Trump Threatened To Shut Down Government For ‘Months Or Even Years’","short_description":"The president met with Democratic leaders for more \"contentious\" negotiations over his border wall."},{"id":401,"headline":"Sitting GOP Congressman Matt Gaetz Hosts Fox News Program","short_description":"The appearance underscores what some see as a symbiotic relationship between Fox News and the Republican Party."},{"id":402,"headline":"Britney Spears Is Taking An 'Indefinite Work Hiatus' After Father's Hospitalization","short_description":"The singer revealed her father, Jamie Spears, \"almost died\" last year."},{"id":403,"headline":"The 20 Funniest Tweets From Women This Week (Dec. 29-Jan. 4)","short_description":"\"I love the exciting moment at a gender reveal party when you find out if the baby will be a boy or if it’ll be unlikable\""},{"id":404,"headline":"Beto O'Rourke Is 'Supportive Of The Concept' Of A Green New Deal","short_description":"The former Texas congressman joins an increasingly crowded field of potential 2020 contenders in embracing the sweeping climate policy."},{"id":405,"headline":"GOP Clutches Pearls Over Rashida Tlaib’s ‘Foul Language,’ Shrugs Over Trump’s","short_description":"Republicans regularly look the other way in response to the president's many vulgar remarks."},{"id":406,"headline":"There's An Explanation For Why You Always Get Sick During Time Off","short_description":"A breakdown of why your body shuts down on vacation, and what to do about it."},{"id":407,"headline":"Nancy Pelosi Says Rashida Tlaib’s ‘Motherf**ker’ Comment No Worse Than Trump","short_description":"\"I’m not in the censorship business,” the House speaker said."},{"id":408,"headline":"Alexandria Ocasio-Cortez Tells Critics Of Viral Video ‘Congresswomen Dance Too’","short_description":"The Democratic lawmaker tweeted a clip of herself jamming out to Edwin Starr's \"War.\""},{"id":409,"headline":"Nearly Half Of Britain Would Want Prince Charles To Abdicate: Survey","short_description":"The Prince of Wales is first in line for the throne, but not in peoples' hearts, apparently."},{"id":410,"headline":"GOP Sen. Pat Roberts Won’t Seek Re-Election In 2020","short_description":"The Republican will retire at the end of his term."},{"id":411,"headline":"Domestic Violence Shelters Scramble To Keep Doors Open Amid Shutdown","short_description":"Federal funds are key for these critical programs, which often operate paycheck to paycheck."},{"id":412,"headline":"Rep. Introduces Bills To Scrap Electoral College, Stop Presidential Self-Pardons","short_description":"The bills are unlikely to pass."},{"id":413,"headline":"Air Travel Less Safe Amid Government Shutdown, Union Leaders, Inspectors Warn","short_description":"\"This shutdown must end now,\" National Air Traffic Controllers Association President Paul Rinaldi said."},{"id":414,"headline":"‘Murphy Brown’ Star Nik Dodani Finds Comedy In Queer Indian-American Experience","short_description":"The actor and comedian, who also stars in \"Escape Room\" and \"Atypical,\" said he feels “fortunate to have come up in a more progressive time” in Hollywood."},{"id":415,"headline":"The Louvre Sees Record Number Of Visitors After Beyoncé’s Music Video","short_description":"After Beyoncé and Jay-Z shot the video for their song “APESHIT” at the Louvre, attendance at the Paris museum rose."},{"id":416,"headline":"1 Year After His Infamous ‘Suicide Forest’ Video, Logan Paul Is Bigger Than Ever","short_description":"The disgraced vlogger earned an estimated $14.5 million in 2018."},{"id":417,"headline":"The Ultimate Scammer Is This Woman On ‘The Bachelor’ Faking An Australian Accent","short_description":"\"Respect. Get that Sugar Bear Hair money girl!\" one fan wrote on Twitter."},{"id":418,"headline":"Deputies Accused Of Leaving Women To Die In Hurricane Charged With Manslaughter","short_description":"Deputies Stephen Flood and Joshua Bishop turned themselves in Friday in South Carolina."},{"id":419,"headline":"People Are Switching Out The Song In ‘Leaked’ Alexandria Ocasio-Cortez Video","short_description":"From Britney Spears' \"Toxic\" to The Killers' \"Mr Brightside,\" a Twitter account shows the congresswoman dancing to them all."},{"id":420,"headline":"Court Favors Trump Administration’s Transgender Military Ban","short_description":"LGBTQ and civil rights advocates have fought against the policy."},{"id":421,"headline":"Trump’s Shutdown Will Hit Black Americans The Hardest","short_description":"Many White families have savings to ride out hard times, like a shutdown furlough. But most Black families do not."},{"id":422,"headline":"New Democratic Lawmaker Flies Trans Pride Flag Outside Her Capitol Hill Office","short_description":"“I wanted to show my solidarity because we are talking about my friends and family,\" she said."},{"id":423,"headline":"Former ‘American Idol’ Host Fiercely Defends Uber Driving Gig","short_description":"The self-described \"television history footnote\" vented after a TMZ report about his regular job."},{"id":424,"headline":"The Most Profound ‘Shower Thoughts’ On Reddit This Week","short_description":"\"If tents were transparent, camping would be a lot scarier.\""},{"id":425,"headline":"Alexandria Ocasio-Cortez Dancing Video Smear Backfires","short_description":"Conservative Twitter uncovered damning evidence proving that progressive Rep. Ocasio-Cortez… can dance?"},{"id":426,"headline":"Domestic Violence Charge Against Redskins Player Reuben Foster Dropped","short_description":"This is the second time charges of domestic violence have been dropped against the linebacker."},{"id":427,"headline":"This Is What No One Tells You About Massive Weight Loss","short_description":"I’ve done all the work, put in all the effort, and still, I struggle ― I still, despite my efforts to the contrary, spend more time hating my body than l..."},{"id":428,"headline":"New Congresswoman Rashida Tlaib Vows To Impeach ‘Motherf**ker’ Trump","short_description":"Hours earlier, the Michigan Democrat become one of the first Muslim women in Congress."},{"id":429,"headline":"Sean Hannity Ties Nancy Pelosi's Vacation To California Cop Killing","short_description":"The Fox News host attacked the newly elected House speaker for being in Hawaii while Trump was \"waiting to negotiate\" on border security."},{"id":430,"headline":"Ellen DeGeneres Begs Kevin Hart To Host The Oscars, Faces Fiery Backlash","short_description":"Hart lost the gig hosting the 2019 Academy Awards after his old homophobic jokes and comments resurfaced."},{"id":431,"headline":"Bill Walton: Barack Obama Should Be UCLA’s Next Basketball Coach","short_description":"The ESPN announcer mounts an amusing on-air campaign urging the former president to lend his leadership to the struggling team."},{"id":432,"headline":"Rachel Maddow Breaks Down Where Donald Trump Gets His Conspiracy Theories","short_description":"The MSNBC host noted how Trump's foreign policy talking points sometimes sound very familiar."},{"id":433,"headline":"Alexandria Ocasio-Cortez Shuts Down GOP Haters With 8 Little Words","short_description":"The youngest congresswoman hit back at Republicans who reportedly booed her."},{"id":434,"headline":"House Democrats Introduce Their Sweeping New Reform Bill","short_description":"The legislation would make it easier to vote, create publicly financed elections, rein in corruption and restore voting rights to millions."},{"id":435,"headline":"70 Chic French Baby Names You'll Want To Use","short_description":"These names for boys and girls are of French origin or have been popular in France."},{"id":436,"headline":"Mainstream Media Is Blowing Its Coverage Of Elizabeth Warren’s DNA Test","short_description":"Tribal leaders and Native people say the senator is an ally — and they support her look at her ancestry. But hardly anyone asked them."},{"id":437,"headline":"6 Marriage Problems Couples With A New Baby Almost Always Face","short_description":"Therapists share the most common relationship issues parents bring up."},{"id":438,"headline":"Jim Carrey Torches Louis C.K. With Cartoon Tribute To Parkland Shooting Survivor","short_description":"Carrey called out the comedian for mocking Marjory Stoneman Douglas High School students in his latest set."},{"id":439,"headline":"Massive Data Hack Targets German Politicians","short_description":"The leak reportedly included addresses, personal letters and copies of identity cards."},{"id":440,"headline":"John Legend Shrugs Off Praise For Daring To Slam R. Kelly Over Assault Claims","short_description":"\"I believe these women,\" Legend said of R. Kelly's alleged victims."},{"id":441,"headline":"UK Airports To Deploy Anti-Drone Technology","short_description":"The facilities are investing millions to prevent future flight disruption."},{"id":442,"headline":"Anderson Cooper Has A Theory About Donald Trump's Latest Weird Instagram Post","short_description":"The \"Game of Thrones\"-style poster of Trump was captioned \"The Wall Is Coming.\""},{"id":443,"headline":"Chinese ‘Jack The Ripper’ Executed For Murdering 11 Girls And Women","short_description":"Gao Chengyong was found guilty of multiple counts of murder, rape, robbery and the mutilation of corpses between 1988 and 2002."},{"id":444,"headline":"Manson Follower Gets Parole After Spending 50 Years In Prison","short_description":"California’s incoming governor, Gavin Newsom, could block the parole in coming months."},{"id":445,"headline":"Wanton Squirrel Scarfs Egg Roll As Twitter Drools","short_description":"Rodents rule."},{"id":446,"headline":"Historic Federal Post Office Tower At Trump Hotel Reopening During Shutdown","short_description":"A spokesman for the Department of the Interior said the parks service was attempting to keep “iconic areas” open during the shutdown, but that did not include the tower — until the GSA stepped in."},{"id":447,"headline":"Mike Pence Says Trump Won’t Budge: ‘No Wall, No Deal’","short_description":"“We really are prepared to negotiate, we’re prepared to talk,\" the vice president told Fox News' Tucker Carlson."},{"id":448,"headline":"Neil DeGrasse Tyson’s ‘StarTalk’ Grounded During Sexual Misconduct Probe","short_description":"Fox Networks and Nat Geo are investigating accusations from three women."},{"id":449,"headline":"Trump Says Country Wants Border Wall, But That’s Not What Polls Say","short_description":"And opponents can't call the White House switchboard to let the president know because it's not working due to the government shutdown."},{"id":450,"headline":"Blackpink Set To Be The First K-Pop Girl Group To Perform At Coachella","short_description":"Perfume, a girl group from Japan, will also hit the stage at the iconic music festival."},{"id":451,"headline":"7 Killed After Fiery Crash, Fuel Spill On Florida Highway","short_description":"The wreck happened on Interstate 75 about a mile (1.6 kilometers) south of Alachua, near Gainesville."},{"id":452,"headline":"Democrats Pass Bill To Reopen Government; Shutdown Continues","short_description":"Senate Republicans say they won't take up the bill."},{"id":453,"headline":"Florida Senate Agrees To Pay Aide $900,000 In Sex Scandal","short_description":"Rachel Perrin Rogers was a top aide to Sen. Wilton Simpson when she first complained about the behavior of then-state Sen. Jack Latvala."},{"id":454,"headline":"Trump’s ‘Game Of Thrones’ Meme On His Border Wall Suggests He’s Never Seen Show","short_description":"The president posted an Instagram pic that said, \"The wall is coming,\" a reference to the tagline of the popular HBO show."},{"id":455,"headline":"Nancy Pelosi Invites Trump To Deliver State Of The Union Address","short_description":"The newly elected House speaker asks the president to address Congress on Jan. 29."},{"id":456,"headline":"Progressive Caucus Stands Down On ‘Pay-Go’ Battle","short_description":"The objections of Ro Khanna and Alexandria Ocasio-Cortez were not enough to stop the pay-as-you-go budget rule."},{"id":457,"headline":"This Congress Is The Most Diverse Ever","short_description":"From the first Muslim women to a historic number of black members, the 116th Congress breaks barriers for representation."},{"id":458,"headline":"This Eagles Fan Attended Every Single Game This Season After A Health Scare","short_description":"After contracting a viral infection in his heart in 2016, Koroun Butler set out on his mission to attend every single 2018 regular season game."},{"id":459,"headline":"Snoop Dogg Wants To Adopt This Abandoned Dog Named Snoop, And It Needs To Happen","short_description":"The pooch was dumped on the street in a heartbreaking viral video."},{"id":460,"headline":"Trump Had It Hard With A GOP Congress. Now Pelosi Will Make His Life Miserable.","short_description":"Gone are the days of House leaders simply ignoring legislation that will make the president and his party look bad."},{"id":461,"headline":"'Leaked' Video Of Alexandria Ocasio-Cortez Proves She... Has Friends, Can Dance - HuffPost","short_description":"'Leaked' Video Of Alexandria Ocasio-Cortez Proves She... Has Friends, Can Dance HuffPost As Rep. Alexandria Ocasio-Cortez was being sworn in to Congress on Thursday, a video apparently intending to smear the young Democrat was being widely..."},{"id":462,"headline":"Dianne Feinstein Throws Support Behind Joe Biden For 2020 Democratic Primary","short_description":"As for a possible presidential run by fellow California Sen. Kamala Harris, Feinstein said, \"She's brand-new here.\""},{"id":463,"headline":"First Native American Congresswomen Share Emotional Moment After Swearing-In","short_description":"Sharice Davids and Deb Haaland shared a sweet moment after officially becoming members of Congress."},{"id":464,"headline":"GOP Senator Says Congress Should Reopen Government Without Wall Funding","short_description":"\"We should continue to do our jobs and get the government open,\" the senator told The Hill."},{"id":465,"headline":"Former President Barack Obama’s ‘Hamilton’ Remix Hits Billboard Chart","short_description":"Obama just made his debut on the Billboard Hot R&B Songs chart."},{"id":466,"headline":"The Bizarre Case Of The Ex-Marine Accused By Russia Of Spying","short_description":"Paul Whelan has reportedly been charged with espionage. Here’s what we know about him and his case so far."},{"id":467,"headline":"Lauren Underwood Makes History As Youngest Black Woman To Serve In Congress","short_description":"The congresswoman has already taken her first constituent call."},{"id":468,"headline":"Chadwick Boseman And Michael B. Jordan Open Up About Once Playing The Same Role","short_description":"One “Black Panther” star got fired and the other got hired for the same character."},{"id":469,"headline":"Twitter Thread Seeking Help For Saudi Comedian, Imprisoned Activist Goes Viral","short_description":"\"American Dad!\" producer Kirk Rudell made an impassioned plea on behalf of his friends Loujain Hathloul and Fahad Albutairi after they were arrested last..."},{"id":470,"headline":"Trump Makes Surprise Visit To White House Briefing Room To Beg For Border Wall","short_description":"The president isn't getting his border wall funding, incoming House Democrats have said."},{"id":471,"headline":"Kathy Griffin Reveals Mom Maggie Has Dementia In Heartbreaking Post","short_description":"Maggie Griffin appeared alongside her daughter for six seasons of \"My Life on the D-List.\""},{"id":472,"headline":"Boy, 11, May Have Died From Allergic Reaction To Smell Of Cooked Fish","short_description":"Steven Jean-Pierre says his son’s last words were “Daddy, I love you,” followed by two kisses."},{"id":473,"headline":"Tucker Carlson Show Mimics Trump With Racist Epithet For Elizabeth Warren","short_description":"The Fox News program repeated the president's \"Pocahontas\" nickname for the Democratic senator."},{"id":474,"headline":"Palestinian Women Celebrate Rashida Tlaib’s Swearing-In With Traditional Dress Photos","short_description":"Women posted photos with #TweetYourThobe to honor the first Palestinian-American congresswoman, who wore the traditional dress to her swearing in."},{"id":475,"headline":"College Basketball Player Collides With The Backboard And It Isn’t Pretty","short_description":"Blaise Meredith of North Central College got a face full of Plexiglas in his block attempt."},{"id":476,"headline":"Up In Smoke: Home Insurance Is Getting To Hard To Find In Wildfire Country","short_description":"'It doesn’t matter if they cut every tree and bush on their property, we would not insure it because of where it sits.'"},{"id":477,"headline":"Joe Scarborough: Press Conference Proof Enough To Declare Trump Unfit For Office","short_description":"The MSNBC host cited the 25th Amendment, which covers the government's ability to remove a sitting president."},{"id":478,"headline":"Congressional Black Caucus Swears In Largest Member Group In History","short_description":"Ilhan Omar, one of the country's first Muslim congresswomen, is among the CBC’s new members."},{"id":479,"headline":"‘The Notebook’ Is Heading To Broadway With Songs By Ingrid Michaelson","short_description":"*Sobs uncontrollably in the rain*"},{"id":480,"headline":"Maxine Waters Casts Her Vote For Pelosi With Catchphrase ‘Reclaiming My Time’","short_description":"The Democratic representative had much of the 116th Congress applauding after she called out her famous words."},{"id":481,"headline":"Police Search For Suspect Who Killed Nail Salon Worker Over $35 Manicure","short_description":"Ngoc Q. Nguyen attempted to stop the suspect from leaving without paying, police said."},{"id":482,"headline":"These Kids Were The Most Excited At The Opening Of The 116th Congress","short_description":"Nancy Pelosi's granddaughter and Rep. Rashida Tlaib's sons brought their A-game to Congress."},{"id":483,"headline":"Elizabeth Warren Backs Withdrawal Of U.S. Troops From Syria And Afghanistan","short_description":"But the senator criticized Trump's sudden tweet on Syria and his failure to discuss his plans with America's allies."},{"id":484,"headline":"Here’s Why Alexandria Ocasio-Cortez Wore All White For Her Swearing-In","short_description":"The youngest congresswoman ever followed in the footsteps of Hillary Clinton, Geraldine Ferraro and Shirley Chisholm."},{"id":485,"headline":"Senate Confirms 4 Trump Nominees To Top Environmental Posts In Last-Minute Vote","short_description":"It's a mixed bag of bureaucrats and industry allies."},{"id":486,"headline":"Mark Hamill Admires The Joker’s Commitment To His New Year’s Resolutions","short_description":"But the \"Star Wars\" actor, who has voiced Batman's nemesis in cartoons, admits there are limits to the respect."},{"id":487,"headline":"Kyrsten Sinema Makes History As First Openly Bisexual Person Sworn In To Senate","short_description":"The Democrat is Arizona's first female senator and only the second openly LGBT person in the Senate."},{"id":488,"headline":"New York City Begins Offering Nonbinary Gender Option On Birth Certificates","short_description":"A new law allowing the choice of “X,” in addition to “male” or “female,” took effect New Year’s Day."},{"id":489,"headline":"Opinion | Sander’s Response To Sexual Harassment Claims Won’t Cut It In 2020","short_description":"Former campaign staffers say they faced sexual harassment on the job. Sanders' response has left them disappointed and disillusioned."},{"id":490,"headline":"Everything You Need To Know About North Carolina's Election Fraud Probe","short_description":"In a nationally watched probe, state officials are examining allegations of election fraud apparently involving absentee ballots."},{"id":491,"headline":"Rep. Nancy Pelosi Takes On President Donald Trump","short_description":"Rep. Nancy Pelosi (D-CA) is the new speaker of the House, and she’s ready to go head-to-head with the president."},{"id":492,"headline":"Trump’s Sexist Playbook Won’t Work Against All These Powerful Women","short_description":"Starting Thursday, the president will be forced to contend with Nancy Pelosi, Maxine Waters, Alexandria Ocasio-Cortez and an onslaught of female politicians. He’s not equipped for it."},{"id":493,"headline":"Nancy Pelosi is elected for the second time to be speaker of the House.","short_description":"House Democrats overwhelmingly cast their votes for the long-serving California representative on Thursday."},{"id":494,"headline":"Like Fruit, Vegetables And Almonds? Scientists Have Bad News.","short_description":"The snow pack that supplies 60 percent of the water to California farms and cities will likely shrink by half by the mid-century."},{"id":495,"headline":"Ariana Grande Makes Coachella History As Youngest Female Headliner Ever","short_description":"The \"thank u, next\" singer tweeted that she was “humbled and excited as all hell” to receive top billing."},{"id":496,"headline":"Trump Rags On Elizabeth Warren’s Native American Heritage In Wordless Tweet","short_description":"The president shared an image of a mock campaign sign after the senator announced she may run for president in 2020."},{"id":497,"headline":"House Democrats Not Rushing To Get Trump’s Tax Returns","short_description":"The delay by the Ways and Means Committee seems like an effort to be civil and statesmanlike … in the Trump era."},{"id":498,"headline":"China’s Lunar Landing May Mean Potatoes And Flowers Grow On The Moon","short_description":"The Chinese Space Agency sent potatoes, flowers and other species to grow on the lunar surface."},{"id":499,"headline":"Krispy Kreme Delivers Pastries To Officers Mourning Loss Of Doughnut Truck","short_description":"A Krispy Kreme spokesman says the company wanted to comfort the officers in their time of sorrow."},{"id":500,"headline":"The Proportion Of Women Directing Top Hollywood Movies Actually Dropped In 2018","short_description":"For 20 years, statistics on women working in big roles on hit movies virtually haven't changed, according to another dismal study."},{"id":501,"headline":"Woman Discovers Drunk Guy Sleeping With Her 150-Pound Mastiff","short_description":"Lynn Sarver got her mastiff, Benton, for protection. How well did that work?"},{"id":502,"headline":"14-Year-Old Driver Charged With Murder After Egg Prank Turns Deadly","short_description":"The boy was allegedly pelting cars with eggs, which led to a high-speed chase that killed 45-year-old Silvia Zavala."},{"id":503,"headline":"MSNBC Host Compares Trump’s Pleas For Wall Funds To Destiny’s Child Song","short_description":"Ari Melber broke out a rendition of \"Bills, Bills, Bills\" to describe Trump's demands for border wall money."},{"id":504,"headline":"33 Tweets About The Keto Diet That Will Make You LOL","short_description":"\"I wanna love something as much as people love talking about their keto diets.\""},{"id":505,"headline":"Pete Davidson Says Louis C.K. Had Major Problems With Him At ‘SNL’","short_description":"Davidson also joked about getting a tattoo of the disgraced comedian."},{"id":506,"headline":"Emotional And Psychological Abuse Are Now Crimes In Ireland","short_description":"“Society will no longer tolerate the appalling breach of trust committed by one partner against the other,\" Ireland’s Minister for Justice and Equality said."},{"id":507,"headline":"Woman Catches A 'River Monster' And Has The Footage To Prove It","short_description":"\"I never in my life seen a fish this big,\" Paula Cathey Smith exclaimed of her 88-pound catfish haul."},{"id":508,"headline":"Reward For 7-Year-Old’s Killer Climbs To $100,000 As Texas Manhunt Continues","short_description":"Jazmine Barnes was shot in a car with her mother and three sisters on Sunday."},{"id":509,"headline":"How Government Shutdowns Affect More Than Just Government Workers","short_description":"According to Fox News host Ainsley Earhardt, the government shutdown is just an “inconvenience.”"},{"id":510,"headline":"Michael B. Jordan Debuts Campaign With Coach As Its First Global Men’s Face","short_description":"The \"Creed II\" star is Coach's new leading man."},{"id":511,"headline":"Kristen Bell Brings Dax Shepard To Tears For Birthday Surprise (And Scare)","short_description":"Yep, still #CoupleGoals."},{"id":512,"headline":"Why Jada Pinkett Smith And Will Smith Don’t Celebrate Wedding Anniversaries","short_description":"The two have been married for more than 20 years."},{"id":513,"headline":"20 Of The Most Heartwarming And Unusual Animal Rescues From 2018","short_description":"The animals include horny hedgehogs trapped in a cattle grid and a cute kitten caught in a kitchen unit."},{"id":514,"headline":"‘The Masked Singer’ Is Great For Furries, Hellish Nightmare For Everyone Else","short_description":"The year 2018 was a surreal freak show of epic proportions. But with Fox's latest reality singing competition show, 2019 boldly says “hold my mask.”"},{"id":515,"headline":"New York Now Requires Changing Tables In All Public Men’s Restrooms","short_description":"New and renovated buildings with public bathrooms in the state must include changing tables accessible to men."},{"id":516,"headline":"Bernie Sanders Addresses Harassment Claims Between Members Of His Campaign Team","short_description":"Sanders told CNN he had no idea that claims of sexual misconduct within his 2016 presidential campaign were ignored."},{"id":517,"headline":"Saudi Arabia Says 5 Suspects Face Death Penalty In Khashoggi Killing","short_description":"The Washington Post columnist's slaying has implicated members of Saudi Crown Prince Mohammed bin Salman’s entourage."},{"id":518,"headline":"Julie Chen has been officially replaced on ‘The Talk’","short_description":"Toasts and hugs all around for a familiar face who succeeds Julie Chen on the CBS chat show."},{"id":519,"headline":"House Democrats Started Investigating Trump This Morning","short_description":"They plan to get answers on the president’s anti-immigration policies and the conflicts of interest and corruption plaguing the administration."},{"id":520,"headline":"Pelosi Says Ability To Indict A Sitting President Is ‘Open Discussion’","short_description":"The incoming House speaker refused to say special counsel Robert Mueller couldn't seek an indictment against President Donald Trump."},{"id":521,"headline":"CNN's Don Lemon Has 1 Question About That Trump 'Game Of Thrones'-Style Poster","short_description":"The \"CNN Tonight\" host couldn't help laughing at the poster, weirdly placed on the table during Wednesday's Cabinet meeting."},{"id":522,"headline":"Pope Francis Spins Soccer Ball On His Finger And Instantly Becomes A Meme","short_description":"The pontiff's soccer skills sparked an amusing \"Photoshop Battle\" on Reddit."},{"id":523,"headline":"Trump Is In His Best Position Yet To Confirm Incompetent Judges","short_description":"Senate Republicans strengthened their majority. Mitch McConnell is laser-focused on the courts. What could go wrong?"},{"id":524,"headline":"Student Fights Back After Her Improved SAT Score Is Invalidated","short_description":"\"They're saying I improved basically too much,\" the Florida high school senior said."},{"id":525,"headline":"CNN’s Anderson Cooper Makes Striking Point About Donald Trump's ‘Good General’ Claim","short_description":"The CNN host explained why \"the world will never know General Trump.\""},{"id":526,"headline":"Obama Makes Billboard Hot R&B Songs Chart Debut","short_description":"The former president made his star turn on a \"Hamilton\" remix."},{"id":527,"headline":"Opinion | Grandpa Keeps Commenting On My Daughters’ Bodies. What Should I Do?","short_description":"Unfortunately, old heads tend to be pretty set in their ways."},{"id":528,"headline":"Opinion | GOPers And Dems Are Wedded To Capitalism. Americans Deserve Better.","short_description":"New and very different parties are needed if we want to take the world in a sustainable direction."},{"id":529,"headline":"15 Easy Ways To Be A Happier Person","short_description":"These research-backed habits will make your life so much better."},{"id":530,"headline":"Opinion | Mike Pompeo Is The Spineless Personification Of Trump’s Foreign Policy","short_description":"His sycophancy stands in stark contrast to Jim Mattis' principled resignation."},{"id":531,"headline":"Opposing Green New Deal Could Cost Popular Democratic Lawmaker Her Job, Poll Shows","short_description":"New polling shows older, suburban women in Democratic Rep. Kathleen Rice's Long Island district overwhelmingly support a Green New Deal."},{"id":532,"headline":"George Conway Schools Trump About Mitt Romney’s Election Statistics","short_description":"Kellyanne Conway's husband shut down Trump with some facts."},{"id":533,"headline":"Pelosi Will Handle Trump In This ‘Game Of Thrones’-Style Way, Her Daughter Says","short_description":"“No one ever won betting against Nancy Pelosi,\" said Alexandra Pelosi of her mother."},{"id":534,"headline":"Tucker Carlson Blames High-Earning Women For 'Men In Decline'","short_description":"\"Study after study has shown that when men make less than women, women generally don't want to marry them.\""},{"id":535,"headline":"Rudy Giuliani Roasted Over Bonkers Late-Night Twitter Rant About Witches","short_description":"\"Only Ben Carson knows what this guy's talking about.\""},{"id":536,"headline":"Nordstrom Department Store Co-President Blake Nordstrom Dies At 58","short_description":"Nordstrom had worked at the chain for more than 40 years."},{"id":537,"headline":"Ariana Grande, Childish Gambino To Headline At Coachella This Year","short_description":"Other performers booked to play at the event include Tame Impala, Janelle Monae, the 1975, DJ Snake, Diplo, Solange and Weezer."},{"id":538,"headline":"The milestone solidifies Beijing’s ambitions to become a leader in space.","short_description":"The Chang’e-4 probe has already sent back photos of the lunar surface."},{"id":539,"headline":"Astronaut Reveals How Surprisingly Easy It Is To Call 911 From Space","short_description":"André Kuipers said he forgot to dial 0 when trying to make a long-distance call from the International Space Station."},{"id":540,"headline":"LA Police Make Arrest In Burglaries Of Celebs’ Homes In Hollywood Hills","short_description":"Entertainers such as Usher, Adam Lambert and Jason Derulo were among 13 victims identified so far, Detective Jared Timmons said."},{"id":541,"headline":"Ilhan Omar Reflects On Being A Refugee As She Prepares To Be Sworn In","short_description":"It was a bittersweet memory as the Minnesota Democrat landed at the same Washington airport she arrived at as a refugee."},{"id":542,"headline":"Bernie Sanders Says He Was Unaware Of Harassment Claims, Will ‘Do Better’","short_description":"The Vermont senator told CNN that he wasn't aware of sexism and discrimination complaints during his 2016 presidential bid, but would take steps to address them."},{"id":543,"headline":"Olivia Newton-John Clears Up Rumors She’s ‘Clinging To Life’ With Video Message","short_description":"The “Grease\" star wants her fans to know that despite her cancer, reports she is dying have been \"greatly exaggerated.\""},{"id":544,"headline":"Daryl Dragon Of Pop Duo Captain and Tennille Dead At 76","short_description":"Dragon was called \"The Captain\" because of his trademark hat."},{"id":545,"headline":"Americans Give Everyone Negative Marks For The Partial Government Shutdown","short_description":"Most of the public considers the shutdown a problem, but just one-third of respondents call it very serious."},{"id":546,"headline":"You Can Star In ‘Hamilton’ And Still Fear For Your Life As A Black Man","short_description":"Carvens Lissaint, once homeless, now stars in one of the biggest hits in Broadway musical history. It hasn't insulated him from racism."},{"id":547,"headline":"Jake Tapper Asks Mitt Romney If Accepting Trump’s Endorsement Was A Mistake","short_description":"The senator-elect wouldn't say why he didn't have a problem when Trump was falsely accusing Barack Obama of being born in Africa."},{"id":548,"headline":"Donald Trump Debuts ‘Game Of Thrones’-Themed Poster At Cabinet Meeting","short_description":"Inspired by HBO's hit flick, the president's \"Sanctions Are Coming\" meme has been turned into a giant poster."},{"id":549,"headline":"Trump’s Border Wall Shutdown Continues Into A New Congress With A Dem. House","short_description":"The president holds a White House \"briefing\" but fails to persuade Democrats to spend taxpayer money on a wall Trump had promised that Mexico would pay for."},{"id":550,"headline":"Romney Pledges Support For Border Wall After Slamming Trump Administration","short_description":"The senator-elect pledged to “speak out\" against \"divisive, racist, sexist, anti-immigrant, dishonest or destructive\" rhetoric from the Trump administration."},{"id":551,"headline":"These Are The Wildest Moments From Trump’s Cabinet Meeting","short_description":"2019 is already off to an interesting start."},{"id":552,"headline":"Jameela Jamil Announces Company Launch To Change How People Talk About Bodies","short_description":"\"The Good Place\" star tweeted that she'd be turning her body-positivity Instagram account \"I Weigh\" into a company."},{"id":553,"headline":"TX County Swears In 17 Black Female Judges In ‘Extraordinary Moment In History’","short_description":"The newly sworn-in elected officials were featured in a viral photo showcasing black women running for judgeships."},{"id":554,"headline":"President Trump Continues To Blame Democrats For Government Shutdown","short_description":"Trump says the government shutdown is the Democrats' fault, because they won’t fund his border wall."},{"id":555,"headline":"Progressives To Put Up Last-Minute Fight To Stop ‘Pay-Go’ Budget Rules","short_description":"Alexandria Ocasio-Cortez and Ro Khanna say the new rules risk hamstringing a progressive agenda."},{"id":556,"headline":"‘Swamp Creature’ Takes Interior Department Reins From Ryan Zinke","short_description":"Zinke resigned Wednesday amid a flurry of scandals. David Bernhardt, the agency’s No. 2 and a former energy lobbyist, has stepped in as acting secretary."},{"id":557,"headline":"For Third Straight Year, Police Suicides Outnumber Line-Of-Duty Deaths","short_description":"Law enforcement agencies across the country lost at least 159 officers to suicide in 2018."},{"id":558,"headline":"Ocasio-Cortez Reveals Powerful Portrait Of A New Wave Of Congresswomen","short_description":"Ayanna Pressley, Ilhan Omar, Deb Haaland, Veronica Escobar, Sharice Davids and Ocasio-Cortez all made history during the 2018 midterms."},{"id":559,"headline":"Netflix Warns People Not To Attempt The ‘Bird Box Challenge’","short_description":"\"Ima do the bird box challenge while eating Tide pods,\" one Twitter user replied."},{"id":560,"headline":"How To Stop Being Wasteful This Year Once And For All","short_description":"How to live a greener, more sustainable lifestyle in 2019."},{"id":561,"headline":"Shutdown Drags On As Democrats Take Back The House Majority","short_description":"Democrats will be able to pressure Republicans, but this could go on for a while."},{"id":562,"headline":"Here Are The Health Benefits Of Giving Up Alcohol For Dry January","short_description":"What happens to your body when you give up booze for a month?"},{"id":563,"headline":"How California’s New Law Protects Survivors Of Sexual Misconduct","short_description":"A new law in California has done away with nondisclosure agreements when it comes to sexual misconduct settlements."},{"id":564,"headline":"‘Curb Your Enthusiasm’ Actor Bob Einstein Dies At 76","short_description":"Before the HBO hit, he was best known for creating the unlucky stuntman character Super Dave Osborne."},{"id":565,"headline":"Ryan Zinke's Farewell Letter To Trump Gets Brutally Mocked On Twitter","short_description":"One person joked the outgoing interior secretary's letter was \"written in the blood of an endangered species.\""},{"id":566,"headline":"NASA Has A Bit Of A Nazi Problem With Its ‘Ultima Thule’ Name","short_description":"The distant space object is named after an ancient term — that was later co-opted by the Nazis."},{"id":567,"headline":"Opinion | DeVos’ Title IX Changes Will Make Life Harder For Sexually Abused Boys","short_description":"Boys are more likely to be sexually assaulted than they are to be falsely accused of assault."},{"id":568,"headline":"Hasan Minhaj Responds To Netflix Removing His Episode In Saudi Arabia","short_description":"The episode criticized Saudi leaders for their role in Yemen and the death of Jamal Khashoggi."},{"id":569,"headline":"Chrissy Teigen Talked About Vaginal Steaming On NYE, And People Got Pissed","short_description":"“My 9-yr-old son does not need to hear about Chrissy’s vaginal steaming,” wrote one Twitter user."},{"id":570,"headline":"Man Assaulted Convenience Store Employee With Banana, Police Say","short_description":"Des Moines police still seem to be processing the fruity attack."},{"id":571,"headline":"Indian Nuns Say Priests Sexually Abused Them For Years","short_description":"The women allege they were groped and kissed by men they were raised to believe were representatives of Jesus Christ."},{"id":572,"headline":"Golden Globes Host Sandra Oh Says She’s ‘Not Interested In’ Talking About Trump","short_description":"Instead, the \"Killing Eve\" star wants to focus on \"actual real change,\" like the massive box office success of \"Black Panther\" and \"Crazy Rich Asians.\""},{"id":573,"headline":"All The Laws You Should Know About That Go Into Effect In 2019","short_description":"From minimum wage hikes to stricter gun control measures and Me Too-inspired legislation, 2019 will usher in thousands of new laws in various states."},{"id":574,"headline":"WWE Announcer ‘Mean’ Gene Okerlund Dead At 76","short_description":"Okerlund was given his \"Mean\" Gene nickname by Jesse “The Body” Ventura, who later became Minnesota governor."},{"id":575,"headline":"Manhunt Underway After 7-Year-Old Girl Killed In Suspected Random Shooting","short_description":"Jazmine Barnes was sitting in her mother's car when a man drove up and fired into the vehicle before fleeing, authorities said."},{"id":576,"headline":"‘Fox & Friends’ Guest: People On Food Stamps Watch Porn, TV Instead Of Working","short_description":"“These guys are not working ... They’re watching porn,\" said Star Parker, founder and president of the conservative Center for Urban Renewal and Education."},{"id":577,"headline":"The New House Democratic Majority Will Take Antitrust Oversight Seriously","short_description":"Democrats will investigate monopolies, oversee the regulators and write new antitrust legislation."},{"id":578,"headline":"RNC Member Calls Mitt Romney’s Criticism Of Trump ‘Political Treachery’","short_description":"\"Seriously. I swear that Republicans can be their own worst enemy,\" Republican National Committee member Jevon O.A. Williams wrote."},{"id":579,"headline":"Fox News' Ainsley Earhardt Says Government Shutdown Merely 'An Inconvenience'","short_description":"Meanwhile, thousands of federal employees have been left without pay as the shutdown hits its 12th day."},{"id":580,"headline":"‘Pretty Little Liars’ Star Reveals She Experienced A Devastating Miscarriage","short_description":"\"I miscarried and lost the child of my hopes and dreams,” the actress wrote on Instagram."},{"id":581,"headline":"How My Sex Life Has Changed After Having A Double Mastectomy","short_description":"How could I feel confident when I was wholeheartedly embarrassed by my jagged pink scars?"},{"id":582,"headline":"Airline Worker 'Ecstatic' After Video Of Him Dancing On Tarmac Went Viral","short_description":"An Instagram video captured an American Airlines employee in Toronto dancing his heart out."},{"id":583,"headline":"Pete Davidson Reveals ‘Sad’ First Reaction To Ariana Grande’s ‘Thank U, Next’","short_description":"The comedian said his mother was even taunted at her work because of the song."},{"id":584,"headline":"Kim Kardashian And Kanye West Reportedly Expecting 4th Child","short_description":"The couple expects to welcome a new baby via a surrogate in the new year."},{"id":585,"headline":"Taylor Swift Dresses Up As Little Mermaid For Star-Studded New Year’s Eve Bash","short_description":"The theme of the night was to dress as your \"childhood heroes.\""},{"id":586,"headline":"Here Are The Best Houseplants For Winter","short_description":"Thinking of adopting a new plant? Here are some plants that will bloom even in the wintertime."},{"id":587,"headline":"Harry Reid: Trump Is ‘The Worst President We’ve Ever Had’","short_description":"The former Senate majority leader also questioned why Jeff Sessions and John Kelly didn't leave the administration sooner."},{"id":588,"headline":"Protests Erupt In India After Women Defy Menstruation Ban At Hindu Temple","short_description":"Two women defied a centuries-old ban this week and entered the Sabarimala temple in Kerala."},{"id":589,"headline":"Andrew Cuomo Calls Out Trump Administration In Ellis Island Inauguration Speech","short_description":"\"Never forget where you came from, and never forget or deny this place.\""},{"id":590,"headline":"‘Morning Joe’ Supercut Taunts Trump Over His ‘Great, Great Wall’ Promises","short_description":"Trump's \"hardened concrete\" campaign boasts are not aging well."},{"id":591,"headline":"Trump Fires Back At Romney: ‘Be A Team Player’","short_description":"\"He should be happy for all Republicans,\" the president tweeted after the senator-elect's scathing op-ed."},{"id":592,"headline":"GOP Ditched Tax Talk For Immigration Attacks In Midterms","short_description":"A new analysis of the 2018 elections shows that even when Republicans did talk about taxes, it wasn’t about their big corporate tax cut."},{"id":593,"headline":"Keira Knightley Reveals Her 1 Reason For Ever Wanting A Penis","short_description":"\"So convenient.\""},{"id":594,"headline":"FCC Faces Near Total Shutdown If Government Doesn’t Reopen","short_description":"The regulator said it “will suspend most operations in the middle of the day on Thursday\" unless the shutdown is resolved."},{"id":595,"headline":"This 20-Year-Old Just Became The Most Expensive American Soccer Player Ever","short_description":"Christian Pulisic is heading to the English Premier League for an astronomical fee."},{"id":596,"headline":"Congressional Leaders To Attend White House Briefing On Border Issues","short_description":"Trump asks in a tweet, \"Let's make a deal?\""},{"id":597,"headline":"Trevor Noah Says The Sweetest Things About His 91-Year-Old Grandmother's Squad","short_description":"“It’s amazing to watch,\" said \"The Daily Show\" host."},{"id":598,"headline":"How To Cut Back On Drinking Alcohol","short_description":"Breaking down small ways you can reduce your alcoholic drinks."},{"id":599,"headline":"Andrew Cuomo Rages Against Trump In Ellis Island Inauguration Speech","short_description":"“This is the harbor where Frederick Trump arrived from Germany and whose grandson would become president of the United States.\""},{"id":600,"headline":"University Seeks To Banish One Of Trump’s Most-Used Words","short_description":"Lake Superior State University is fed up with Trump's constant use of this term."},{"id":601,"headline":"Terrifying Wave Of ‘Firenadoes’ Is Like Something From An Apocalypse Movie","short_description":"An out-of-control bonfire led to multiple fire whirls moving across a Dutch beach."},{"id":602,"headline":"Trump Gets Busted Boasting About Positive News Coverage Written By Own Aides","short_description":"Trump proudly declared a Washington Examiner list to be \"True!\" – but conveniently forgot to mention it was written by the White House."},{"id":603,"headline":"Mark Zuckerberg Says Facebook Can't Stop All Election Interference","short_description":"The social media giant chalked it up to an issue that \"can never fully be solved.\""},{"id":604,"headline":"Jim Carrey’s Gross Trump Cartoon May Put You Off Your Food","short_description":"The actor-artist served up a reminder to voters with his latest anti-Trump artwork."},{"id":605,"headline":"Trump’s New Year’s Day Message Triggers A Twitter Freak-Out","short_description":"The president's all-caps tweet does little to \"calm\" his critics."},{"id":606,"headline":"Obama Issues Battle Cry With First Twitter Post Of 2019","short_description":"It was in stark contrast to Donald Trump's New Year's message."},{"id":607,"headline":"Romney Op-Ed Met With Mockery: ‘That Guy That Ironed A Shirt While Wearing It?’","short_description":"Twitter had a field day with Romney’s Trump-bashing editorial."},{"id":608,"headline":"Jerry Falwell Jr. Gets A Bible Lesson After Tone-Deaf Comments About Poor People","short_description":"Evangelical Trump supporter said poor people don't provide jobs or charity."},{"id":609,"headline":"Trump 2020 Manager Claps Back At Romney: Jealousy ‘Is Drink Best Served Warm’","short_description":"\"Poor Brad, the IT guy way way way over his head.\""},{"id":610,"headline":"Kim Kardashian Is Extremely Late To The ‘Bird Box’ Party","short_description":"All those memes she's undoubtedly been seeing must all make sense now."},{"id":611,"headline":"Washington Bans Assault Rifle Sales To Anyone Under 21","short_description":"The new law is part of a sweeping gun-control initiative passed in November."},{"id":612,"headline":"George Conway Burns Trump With A Savage Explanation For Low Gas Prices","short_description":"Kellyanne Conway’s husband hits back at Trump on Twitter."},{"id":613,"headline":"Vancouver Restaurant Denies Serving Up Dead Rat In Chowder","short_description":"Crab Park Chowdery is adamant that there is no way the incident could have happened in their kitchen."},{"id":614,"headline":"Mitt Romney All But Urges Republicans To Dump Trump In Searing Op-Ed","short_description":"The former Republican presidential candidate has been called out for flip flopping on his support of Trump in the past."},{"id":615,"headline":"Border Patrol Fires Tear Gas Into Mexico As Migrants Attempt To Cross To U.S.","short_description":"The agency accused migrants of throwing rocks at Border Patrol officers."},{"id":616,"headline":"Trump Says Retired 4-Star Gen. Who Called Him ‘Immoral’ Has ‘A Big, Dumb Mouth’","short_description":"Trump was apparently mad that Stanley McChrystal called him \"shady\" and \"immoral.\""},{"id":617,"headline":"American Detained In Russia Over Spy Claims Was There For Wedding: Family","short_description":"Paul Whelan is accused of conducting a \"spy mission\" while in Moscow — a claim that his family disputes."},{"id":618,"headline":"Kanye West Rings In 2019 With Bizarre Political Tweetstorm","short_description":"In October the rapper tweeted he was \"distancing\" himself \"from politics.\" Now he's back to tweeting about Trump."},{"id":619,"headline":"Congress Leaders Invited To White House For Border Briefing","short_description":"The partial government shutdown began Dec. 22 after Trump bowed to conservative demands that he fight to secure funding for the border wall."},{"id":620,"headline":"Elizabeth Smart Unhappy Her Kidnapper Is Living Near An Elementary School","short_description":"Registered sex offender Wanda Barzee was released from a Utah prison in September."},{"id":621,"headline":"World's Oldest Person, Jeanne Calment, May Have Faked Her Age: Report","short_description":"Researchers who verified Jeanne Calment's claim say the new theory is nonsense."},{"id":622,"headline":"Kentucky Police Cry Over Burnt Krispy Kreme Truck; Doughnut Humor Ensues","short_description":"The Lexington Police Department posted images of sad officers in front of a scorched Krispy Kreme truck, leading other departments to respond on Twitter."},{"id":623,"headline":"Tiffany Haddish Bombs During New Year’s Eve Gig, Ends Up Drinking With Fans","short_description":"When the crowd started walking out, she admitted, “This is going to be on TMZ or whatever.”"},{"id":624,"headline":"‘Stranger Things’ Season 3 Will Debut July 4","short_description":"Netflix teased the horror/sci-fi series' return on New Year's Day with an eerie poster and trailer."},{"id":625,"headline":"Happy New Year! See How Gun Violence Rang In 2019.","short_description":"There were several shootings around the U.S. on New Year’s Day."},{"id":626,"headline":"Kevin Spacey Says He'll Plead Not Guilty To Sexual Assault Charge","short_description":"A Massachusetts judge denied the \"House of Cards\" star's request to skip a court appearance Monday."},{"id":627,"headline":"Netflix Takes Down Episode Of Hasan Minhaj’s Show After Saudi Arabia Complains","short_description":"In an episode of \"Patriot Act with Hasan Minhaj,\" the host criticizes Saudi Crown Prince Mohammed bin Salman and the Yemen war."},{"id":628,"headline":"Jane Curtin: ‘New Year’s Resolution Is To Make Sure The Republican Party Dies’","short_description":"The \"SNL\" alum quipped about her 2019 resolution on CNN, and Twitter had a lot to say about it."},{"id":629,"headline":"Madonna Drops By Stonewall For Surprise New Year's Eve Performance - HuffPost","short_description":"Madonna Drops By Stonewall For Surprise New Year's Eve Performance HuffPost See Madonna’s Surprise NYE ‘Like a Prayer’ Performance at Stonewall Inn Rolling Stone Madonna Gives Surprise New Year’s Eve Performance at Stonewall Inn (Watch) Variety Madonna Makes …"},{"id":630,"headline":"Minivan Slams Into New Year’s Revelers In Tokyo, Injuring 8 People","short_description":"The 21-year-old driver was arrested after suspected of intentionally driving his car into the crowd early Tuesday."},{"id":631,"headline":"Ricky Martin Welcomes A Daughter, Lucia, With Husband Jwan Yosef","short_description":"The “Livin’ la Vida Loca” singer announced the New Year's Eve arrival on Instagram."},{"id":632,"headline":"New ‘Church’ Wants To Save Lives — By Offering A Safe Place To Shoot Up","short_description":"When a disillusioned young advocate didn’t think public health officials were taking drug overdose deaths seriously, he vowed to step in."},{"id":633,"headline":"Opinion | If Democrats Want To Win, They Need To Embrace The Power Of Rage","short_description":"For a lot of Americans, life simply sucks and isn’t getting better. The Democratic nominee needs to channel their rage about that."},{"id":634,"headline":"Far-right president Jair Bolsonaro is a model for authoritarianism.","short_description":"Far-right president Jair Bolsonaro is a threat to Brazilian democracy — and a model for authoritarianism that leaders around the world will follow."},{"id":635,"headline":"‘I’m Not Drunk!‘: Don Lemon Sings, Cradles Puppies, Gets ‘Lady Lit’ For NYE","short_description":"“Everyone wants to see Don Lemon get lady lit!” he told co-host Brooke Baldwin."},{"id":636,"headline":"U.S. Strategic Command Apologizes For Joke About Dropping Bombs For New Year’s","short_description":"\"Guys, what time did we start drinking?\""},{"id":637,"headline":"Elizabeth Warren's Video Aims To Remind People Why They Liked Her In The First Place","short_description":"Following the DNA controversy, even some progressives seem to have forgotten where the senator came from and what she's accomplished."},{"id":638,"headline":"Trump: Ask Warren’s Psychiatrist If She Thinks She Can Win 2020","short_description":"In a New Year's Eve Q&A with Fox News, Trump mocked Sen. Elizabeth Warren's chances at the presidency, suggesting a second term was in the bag."},{"id":639,"headline":"National Parks Getting Trashed During Government Shutdown","short_description":"Filth spreads as overused restrooms and trash bins are locked, causing public health concerns."},{"id":640,"headline":"Chrissy Teigen’s 2019 Begins With A Hilariously Awkward Moment On Live TV","short_description":"That looked painful."},{"id":641,"headline":"Kim Jong Un Says He’s Ready To Meet With Trump Again In New Year’s Speech","short_description":"The North Korean leader, however, warned that Pyongyang would take a \"different path\" if the U.S. continues to \"misjudge\" its patience with sanctions and..."},{"id":642,"headline":"Andy Cohen Drops Baby Gender Reveal On New Year's Eve Broadcast","short_description":"\"I just never thought it would be possible as a gay man to grow up and have a family,\" Cohen said."},{"id":643,"headline":"Post-Suicide Scare, Pete Davidson Returns To Stage, Joking About Ariana Grande","short_description":"His routine ranged from commentary on Louis C.K. to ex-girlfriend Ariana Grande"},{"id":644,"headline":"Runaway Cow Gives Birth 2 Days After Fleeing Slaughterhouse-Bound Truck","short_description":"The cow and her calf will spend the rest of their days at an animal sanctuary."},{"id":645,"headline":"Anderson Cooper Loses It While Taking Shots On Air: ‘Like Burning Your Lungs!’","short_description":"Bursting into a coughing fit, Cooper wheezed, letting out an “ahh!” after taking a tequila shot."},{"id":646,"headline":"Refuting Trump, Neighbors Say Obamas Definitely Don’t Have A ’10-Foot Wall’","short_description":"Trump “has a very active imagination,\" one neighbor quipped."},{"id":647,"headline":"Trump Contradicts Himself On Border Wall In Tweets 11 Minutes Apart","short_description":"Mexico's paying for it with trade savings. Democrats should fund it with tax dollars. Fickle Trump gives Twitter whiplash."},{"id":648,"headline":"NASA Tracking Flyby Of Most Distant Space Expedition In Human History","short_description":"Mysterious out-of-this world Ultima Thule is a billion miles beyond Pluto, 4 billion miles from Earth."},{"id":649,"headline":"Trump Releases Self-Pitying ‘Happy New Year’ Video","short_description":"“While I’m at the White House working, you’re out there partying tonight. But I don’t blame you,” the president tweeted."},{"id":650,"headline":"Alabama Sheriff Pocketed $1.5 Million In ICE Funds For Immigrant Food: Report","short_description":"State law allows sheriffs to pocket unspent food money. It's not clear that applies to federal dollars, too."},{"id":651,"headline":"Sandra Bullock's New Netflix Movie Inspires People To Take 'Bird Box' Challenge","short_description":"A new meme closes out the old year."},{"id":652,"headline":"61 Books We’re Looking Forward To Reading In 2019","short_description":"New year, new books, new to-read piles."},{"id":653,"headline":"Trump To Skip Mar-a-Lago Party With Guests Who Paid $1,000 Each To See Him","short_description":"Trump profits personally from memberships and tickets at the Palm Beach resort, despite his campaign promise to remove himself from his private business."},{"id":654,"headline":"Louis C.K. Mocked Asian And Black Men In That Standup Rant, Too","short_description":"The comedian also disparaged the survivors of the Parkland high school massacre."},{"id":655,"headline":"Federal Employee Union Sues Government Over Shutdown, Alleging Wage Theft","short_description":"The union said employees can't be forced to work without pay."},{"id":656,"headline":"George Conway Zings President Trump After New York Times Report","short_description":"The husband of Trump adviser Kellyanne Conway has a history of taking shots at the president."},{"id":657,"headline":"Twitter Users Pounce On Donald Trump Jr.’s Very Bleak Birthday Tweet","short_description":"The president's son celebrated his 41st birthday by retweeting an article featuring \"his most bada$$ Instagram photos to date.\""},{"id":658,"headline":"Evangelical Preacher Accuses Facebook Of 'Censoring Free Speech' After Getting Blocked","short_description":"Franklin Graham's Facebook account was temporarily blocked over an old post he wrote attacking transgender rights."},{"id":659,"headline":"Roger Federer Will Face Off With Serena Williams For The First Time","short_description":"The tennis legends will play a mixed doubles match on New Year's Day at the Hopman Cup in Australia."},{"id":660,"headline":"U.S. Stocks Suffer Worst Year Since 2008 Financial Crisis","short_description":"Despite a dismal year, the market closed out 2018 on a bright note."},{"id":661,"headline":"3 Newly Discovered Beetles Named After 'Game Of Thrones' Dragons","short_description":"The three beetles honor dragons owned by Daenerys Targaryen on the HBO series."},{"id":662,"headline":"These 16 Polls Show How American Thinking Has (And Hasn’t) Changed In 80 Years","short_description":"Generations past and present weigh in on everything from hitchhikers to financial windfalls to the honesty of Congress."},{"id":663,"headline":"Paul McCartney Reveals John Lennon’s Biggest Fear","short_description":"The legendary musician also admitted to “60 Minutes” that Lennon only complimented one of his songs."},{"id":664,"headline":"Justin Bieber Is Ending 2018 By Feuding With 15-Year-Old Pop Star JoJo Siwa","short_description":"The singer picked a fight over the YouTube star's rainbow-colored car."},{"id":665,"headline":"Top State Dept. Official Who Resigned In Protest Bids Farewell To Colleagues","short_description":"The outgoing U.S. envoy to the global coalition fighting ISIS resigned over President Donald Trump's Syria withdrawal plan."},{"id":666,"headline":"The Beautiful Clutter Of Black Film In 2018","short_description":"2018 was a case study in the explosion of creativity that can ensue when filmmakers are liberated from the burden of being the Only One."},{"id":667,"headline":"Celebrating New Year’s Around The World","short_description":"New Year's celebrations around the world vary from smashing plates to dressing up as bears."},{"id":668,"headline":"5 Of The Wildest Conspiracy Theories YouTube Promoted In 2018","short_description":"Once you fall down YouTube’s conspiracy theory rabbit hole, its algorithm will continue feeding you disinformation."},{"id":669,"headline":"Louis C.K.‘s ‘Pathetic Jokes’ About Parkland Shooting Slammed By Victim’s Dad","short_description":"Fred Guttenberg, who lost his daughter in the Feb. 14 mass shooting, offered the comedian could \"come to my house and try out your new pathetic jokes.\""},{"id":670,"headline":"This Is What No One Tells You About Coming Off Antidepressants","short_description":"Every time I’ve stopped or reduced my meds through tapering, I’ve experienced symptoms of discontinuation to some extent."},{"id":671,"headline":"Lil Pump Apologizes For ‘Ching Chong’ Lyrics, Racist Slant-Eye Gesture","short_description":"He has also removed his original video from Instagram."},{"id":672,"headline":"Louisiana Police Sucker Media With Offer To 'Test' Meth For Zika","short_description":"The Harahan Police Department's faux Facebook post was an \"attempt at humor.\""},{"id":673,"headline":"Ninja To Stream A New Year’s Eve Celebration From Times Square","short_description":"The world's most popular gaming streamer is about to give the networks a run for their money."},{"id":674,"headline":"Black Harassment Went Viral In 2018. Here’s What It’s Like To Be The Target.","short_description":"In October, police were called on Corey Lewis as he was babysitting two white kids. He’s trying to turn that trauma into good."},{"id":675,"headline":"David Petraeus Suggests He Would Reject Offer To Serve Under Trump","short_description":"The former commander of U.S. forces in Afghanistan appeared to quash rumors that he will succeed Jim Mattis as secretary of defense."},{"id":676,"headline":"Jonathan Van Ness Says ‘Thank U, Next’ To Boyfriend In Breakup Post","short_description":"The \"Queer Eye\" star is skating solo into the new year."},{"id":677,"headline":"TSA Workers Vent Anger At Shutdown As They Work Without Pay Over Holidays","short_description":"Officers are worried about how they'll pay rent or feed their families if the crisis drags on."},{"id":678,"headline":"Hillary Posts Year-End Thoughts, Calls 2018 ‘A Dark Time For Our Country’","short_description":"The former first lady addressed the migrant caravan, journalism, \"candidates who ran races with grit\" and more on her Instagram."},{"id":679,"headline":"Opinion | Elizabeth Warren Is Running And There’s No Democrat More Qualified","short_description":"Her regrettable stumble over her DNA aside, Democrats should recognize her talent for talking about race and class."},{"id":680,"headline":"Watch Cities Around The World Celebrate New Year’s Eve 2018","short_description":"From Hong Kong to Sydney, here's how billions around the world are ringing in 2019."},{"id":681,"headline":"Do You Really Know What’s In Your Tampons? This Woman Thinks You Should.","short_description":"There is no law requiring tampon makers to disclose their ingredients. Yet."},{"id":682,"headline":"Dwayne ‘The Rock’ Johnson Sees The Best In Being In A Really Bad Movie","short_description":"He had a good laugh about getting a Razzie Award for \"Baywatch.\""},{"id":683,"headline":"Here Are 21 LGBTQ Celebrity Coming-Out Stories That Shaped 2018","short_description":"Congrats to Janelle Monáe, Jake Borelli, Josie Totah and more."},{"id":684,"headline":"Vienna’s Roller Derby Redefining Masculinity With ‘Fearleaders’","short_description":"The group's website says Fearleading \"means taking fear away. Especially from men. Fear of not being strong enough, not behaving manly enough, not perfor..."},{"id":685,"headline":"Bernie Alumni Request Meeting To Address ‘Sexual Violence’ On 2016 Campaign","short_description":"The unidentified group of former staffers want to “mitigate the issue in the upcoming presidential cycle.”"},{"id":686,"headline":"Michigan Cop Charged With Kidnapping, Sexually Assaulting Women He Arrested","short_description":"George Zofchak, an 11-year veteran of the Genesee County Sheriff’s Department, is accused of forcing a shoplifting suspect into sex."},{"id":687,"headline":"California Cities Struggle To Help Minorities Build Marijuana Businesses - HuffPost","short_description":"California Cities Struggle To Help Minorities Build Marijuana Businesses HuffPost Long wait and lack of money plague efforts to offer financial aid and boost access to the booming industry."},{"id":688,"headline":"Celine Dion Reaches The Edge Of Glory At Lady Gaga’s Las Vegas Show","short_description":"The singer was living her best life in the audience at the \"Enigma\" residency."},{"id":689,"headline":"Florida Fisherman Hooks Nearly 60 Pounds Of Cocaine","short_description":"Holy mackerel!"},{"id":690,"headline":"Jim Mattis Implores Defense Dept. To Defend The Constitution In Farewell Memo","short_description":"Mattis was forced out of his job early after his resignation letter angered President Donald Trump."},{"id":691,"headline":"Judge Who Ruled Against Obamacare Says It Can Stay In Place During Appeals","short_description":"Next stop is the Fifth Circuit Court of Appeals, which is full of conservative judges."},{"id":692,"headline":"Trump Continues To Promise ‘Concrete’ Border Wall Amid Government Shutdown","short_description":"Trump has vowed to build a border wall, even though his allies aren’t sure if it will be a wall, fence or \"a metaphor.”"},{"id":693,"headline":"SafeSport CEO Shellie Pfohl To Step Down Next Month","short_description":"The organization, tasked with preventing sex abuse in Olympic sports, has been criticized for not acting quickly enough in cases like the Larry Nassar sc..."},{"id":694,"headline":"It’s OK That I Don’t Drink. It’s Not OK That You Ask Why.","short_description":"Stop being the alcohol police."},{"id":695,"headline":"Elizabeth Warren Moves Toward 2020 Bid With Launch Of Exploratory Committee","short_description":"The progressive senator is taking the first step toward officially jumping into the presidential race."},{"id":696,"headline":"Spectators Are In For Rainy New Year’s Eve In Times Square","short_description":"Forecasters say Monday's party will take place amid mild temperatures but possibly rain."},{"id":697,"headline":"‘Overwhelmingly White’ California Women’s March Canceled","short_description":"Organizers said they would work harder to attract participants who reflect the community's diversity."},{"id":698,"headline":"America Isn’t As Polarized As You Think It Is","short_description":"The myth of America's political divide needs to die."},{"id":699,"headline":"Trump Ends 2018 With At Least A Dozen Ongoing Scandals","short_description":"Americans have some questions that need answers."},{"id":700,"headline":"Rep. Jeffries: Trump Holding America ‘Hostage’ With His $5 Billion ‘Ransom Note’","short_description":"“What Donald Trump and the Republicans want to do is waste $5 billion in taxpayer money on an ineffective, medieval border wall that is a 5th-century solution to a 21st-century problem.\""},{"id":701,"headline":"Minimum Wage To Increase In 20 States And 21 Cities","short_description":"Thirteen counties and cities will notice the difference immediately on January 1, reaching or exceeding $15 an hour."},{"id":702,"headline":"Washington Post Blasts 'Trump’s Year Of Lies' With Blistering Fact Check","short_description":"Trump reportedly averaged more than 15 falsehoods a day in 2018."},{"id":703,"headline":"Twitter Users Share The Most Ridiculous Gifts They Received For Christmas","short_description":"Who wouldn't want a cushion with Nicolas Cage's face on it?"},{"id":704,"headline":"Chuck Todd Refuses To Give Air Time To Climate Deniers: 'The Science Is Settled'","short_description":"“We’re not going to debate climate change, the existence of it. The Earth is getting hotter, and human activity is a major cause. Period.”"},{"id":705,"headline":"Bald Eagle Causes Flap After Landing On Petrified Fan At Cotton Bowl","short_description":"Big bird leaves cowering human perch to try out another arm in the Texas stadium."},{"id":706,"headline":"Louis C.K.’s Sexually Explicit Stand-Up Rant Proves He’s Learned Nothing In 2018","short_description":"A bootleg recording of a performance by the disgraced comedian was shared online on Sunday."},{"id":707,"headline":"Meghan Markle’s Half-Sister Placed On ‘Fixated Persons’ Watch List: Report","short_description":"Police and royal security will reportedly be on the lookout for Samantha Grant."},{"id":708,"headline":"Lindsey Graham Reduces Trump’s Border Wall To Just A ‘Metaphor’","short_description":"The president's wall turned into \"steel slats,\" a \"beaded curtain\" and has now become a figure of speech."},{"id":709,"headline":"Fitness YouTuber Dies After Being Tased By Police As He Stabbed His Tinder Date","short_description":"Erich Stelzer, 25, had viciously attacked a woman he met on the popular dating app, according to police in Cohasset, Mass."},{"id":710,"headline":"Lindsey Graham Suggests Trump ‘Re-evaluating’ Syria Withdrawal Plan","short_description":"\"I think the president’s trip to Iraq was eye-opening,\" the Republican senator said."},{"id":711,"headline":"Worker Killed After Lion Escapes North Carolina Preserve’s Enclosure","short_description":"Authorities say Alexandra Black, 22, was killed after the lion somehow escaped a locked space at the Conservators Center."},{"id":712,"headline":"Man With Gun Told Police He Was Going To Texas Church To Fulfill ‘A Prophecy’","short_description":"Seguin police arrested 33-year-old Tony Albert, who they said was wearing tactical gear and carrying extra ammunition."},{"id":713,"headline":"California’s Pet Stores To Only Sell Rescue Cats, Dogs And Rabbits","short_description":"A new law requires all pet stores to identify the public agency, shelter or rescue group that the animals came from."},{"id":714,"headline":"Amy Schumer Shares Update On Her Bowel Movements Amid Tough Pregnancy","short_description":"Chris Rock left his thoughts on Schumer's VERY candid post."},{"id":715,"headline":"Trump Continues To Blame Democrats Amid Shutdown Stalemate","short_description":"The president is holding out for billions in federal funds for a border wall he repeatedly promised would be paid for by Mexico."},{"id":716,"headline":"Mandy Moore Took Fans On Every Step Of Her Epic Honeymoon","short_description":"The two singers wed in November after two years of dating."},{"id":717,"headline":"Bangladesh Opposition Leader Rejects Results Of Election Marred By Violence","short_description":"At least 17 people were killed in election-related violence on Sunday, police said."},{"id":718,"headline":"Retired 4-Star Gen. Stanley McChrystal: I Wouldn’t Work For ‘Shady’ Trump","short_description":"\"It's important for me to work for people who I think are basically honest,\" he said."},{"id":719,"headline":"John Kelly Blames Jeff Sessions For Family Separation Policy: ‘He Surprised Us’","short_description":"Trump's outgoing chief of staff bashed the administration for not foreseeing blowback over the \"zero-tolerance\" immigration policy."},{"id":720,"headline":"Philippine President Duterte Suggests He Sexually Assaulted Maid As A Teen","short_description":"The controversial president says he told a priest that he snuck into his maid's room and \"touched\" her while she slept."},{"id":721,"headline":"Swiss National Arrested In Scandinavian Tourist Murders In Morocco","short_description":"Nineteen other men have been arrested in the deaths of Louisa Vesterager Jespersen, 24, and Maren Ueland, 28."},{"id":722,"headline":"I Was A Cable Guy. I Saw The Worst Of America.","short_description":"A glimpse of the suburban grotesque, featuring Russian mobsters, Fox News rage addicts, a caged man in a sex dungeon, and Dick Cheney."},{"id":723,"headline":"2018 Was A Bad Year For The NRA, And The Worst Could Be Yet To Come","short_description":"Was it just a blip, or could the National Rifle Association's power be starting to wane for good?"},{"id":724,"headline":"Opinion | ‘BlacKkKlansman’ Was The Most Frighteningly Accurate Movie Of 2018","short_description":"No other film captured the racist terrors of this year quite like Spike Lee's tale of a black cop who confronted the Ku Klux Klan."},{"id":725,"headline":"Ryan Zinke Is An Oilman, Ladies And Gentlemen","short_description":"The interior secretary vowed to leave a conservation legacy that would rival Theodore Roosevelt's. Instead, he drank America’s milkshake."},{"id":726,"headline":"Videos Show Migrant Children Being Slapped, Dragged At Since-Shuttered Shelter","short_description":"The Hacienda Del Sol shelter, run by the embattled Southwest Key Programs, was shut down by the federal government in October."},{"id":727,"headline":"Journalists Will Press The Times Square Ball Drop Button On New Year’s","short_description":"“In one of the world’s most famous public squares it is fitting to celebrate free press and free speech as we reflect on where we’ve been during the past year and what it is we value most as a society,\" Times Square Alliance President Tim Tompkins said."},{"id":728,"headline":"Opinion | Justice Kennedy Delivered 2018′s Most Preventable Disaster","short_description":"If America's fate rests with the Supreme Court, the future looks bleak."},{"id":729,"headline":"Conservative Columnist's 'I Don't Care' Tweet On Yemeni Mom's Dead Son Sparks Outrage","short_description":"\"Is this guy a psychopath?\" a stunned Twitter user asked."},{"id":730,"headline":"This Year’s Natural Disasters Show Climate Change’s Dire Consequences Are Already Here","short_description":"In 2018, record-breaking wildfires and historic levels of rain have hit the U.S."},{"id":731,"headline":"Michael Bloomberg: 2020 Candidates ‘Better Darn Well’ Deal With Global Warming","short_description":"“The presidency is not an entry-level job,” he said. “We have some real problems.\""},{"id":732,"headline":"Melania Trump’s Infamous Whale Tweet Morphs Into Giraffe, Baffling Internet","short_description":"Twitter users immediately took to the platform with screenshots of the drastically different photos, bewildered by the change."},{"id":733,"headline":"FBI Has Fake Green Cards Allegedly Supplied By Trump Golf Club Managers: Report","short_description":"Attorney for immigrants also said he turned over fraudulent Social Security numbers provided by managers at the Trump National Golf Club."},{"id":734,"headline":"Royal Family Reveals Top Moments of 2018 In New Video","short_description":"“Here are some of our favourite moments from 2018 ― thank you to everyone who made this year so special,” Kensington Palace said in a tweet."},{"id":735,"headline":"6 Times Trump ‘Hit A New Low’ In 2018","short_description":"A congressman said Trump hit “a new low” with his latest tweets — but this isn’t the first time the president has sunk to a “new low.”"},{"id":736,"headline":"STOP THE PRESSES! Apparent Foreign Cyberattack Wreaks Havoc On U.S. Newspapers","short_description":"“A disruption to our print production systems caused delays in the delivery of some of our newspapers Saturday,” Tribune Publishing Company said Saturday."},{"id":737,"headline":"Hard-Pressed American Farmers Left Out In The Cold By New 11-Nation Trade Treaty","short_description":"Aussie, Canadian farmers celebrate treaty Trump nixed, while U.S. wheat producers fear Japan market collapse."},{"id":738,"headline":"4 Devious Ways States Chipped Away At Abortion Rights In 2018","short_description":"The past year's restrictions were particularly extreme."},{"id":739,"headline":"Dwayne ‘The Rock’ Johnson Surprises Mom With A New Home For Christmas","short_description":"Just one of the perks of being the mother of the second highest-paid actor in Hollywood."},{"id":740,"headline":"Ocasio-Cortez Says McCaskill Calling Her A ‘Shiny Object’ Is ‘Disappointing’","short_description":"The outgoing senator once warned Democrats not to go \"so far to the left.\""},{"id":741,"headline":"‘Consequences, Subpoenas’ In Trump’s Future, Vows House Oversight Cmte. Member","short_description":"\"Donald Trump is inappropriate on so many levels,\" said Rep. Brenda Lawrence (D-Mich.)."},{"id":742,"headline":"Trump Lies Again About 19,000 ‘Deleted’ FBI Text Messages","short_description":"The inspector general of the president's own Justice Department concluded the texts were missing due to technological glitches; 20,000 were recovered."},{"id":743,"headline":"Fisher’s Family ‘Thrilled At What’s Been Done’ With Leia In Next ‘Star Wars’","short_description":"Todd Fisher had only good things to say about how J.J. Abrams planned to feature his late sister."},{"id":744,"headline":"Barry Jenkins Says He’s A ‘Stan’ For Young ‘Bird Box’ Actress Who Plays ‘Girl’","short_description":"\"Steals every scene, every moment she’s on screen,\" the Oscar-winning director wrote on Twitter."},{"id":745,"headline":"The Real Reason Why Some Bernie Sanders Fans Have It In For Beto O’Rourke","short_description":"They worry that defections from Sanders' 2016 team will \"whitewash\" O'Rourke's policy record."},{"id":746,"headline":"Hotel Employees Fired After Calling 911 On Black Guest Using His Phone","short_description":"Jermaine Massey was asked to leave the DoubleTree hotel in Portland, Oregon, and give up his room after employees encountered him in the lobby."},{"id":747,"headline":"This ‘Fifty Shades Of Bumblebee’ Mashup Is A Real Sexy Transformation","short_description":"We've had plenty of robot action, now how about some robot ACTION."},{"id":748,"headline":"Trump Blocks Federal Workers’ Pay Hike While They’re Out Of A Job","short_description":"In the middle of a government shutdown, Trump ordered that federal worker pay not be increased for 2019."},{"id":749,"headline":"Gabrielle Union Shuts Down Fan Who Told Her To ‘Dress Her Age’","short_description":"Bring it on, trolls."},{"id":750,"headline":"Trump Blames Democrats For Deaths Of 2 Children In U.S. Custody","short_description":"“If we had a Wall, they wouldn’t even try!” the president claimed."},{"id":751,"headline":"Cow Escapes From Slaughterhouse-Bound Truck, Begins New Life At Sanctuary","short_description":"After breaking free on a New Jersey highway, Brianna is starting over at Skylands Animal Sanctuary."},{"id":752,"headline":"Serena Williams' Daughter Did The Cutest Thing Watching Her Mom And Aunt Venus Williams Play Tennis","short_description":"What a good sport!"},{"id":753,"headline":"College Wrestler Leaps Into Icy Lake To Rescue Cat","short_description":"Darden Schurg admits the move was dangerous, but said, \"I felt it was only right.\""},{"id":754,"headline":"Angelina Jolie On Why She Doesn’t Want ‘Perfectly Behaved’ Children","short_description":"The actress and humanitarian had a rebellious streak herself when she was younger."},{"id":755,"headline":"2-Year-Old Yemeni Boy Whose Mom Sued U.S. To See Him Has Died","short_description":"Shaima Swileh was finally able to see her son, Abdullah Hassan, in the hospital 10 days ago."},{"id":756,"headline":"Trauma Is The Norm For Many New Orleans Kids. This School Was Made For Them.","short_description":"A staggering percentage of kids in New Orleans experience trauma. Safe spaces at schools are hard to come by."},{"id":757,"headline":"Conservative Christians Were The Political Pawns Of 2018","short_description":"Trump is a chess master, moving Christians toward the death of their integrity and the increase of his own power."},{"id":758,"headline":"Was Hastings' Car Hacked?","short_description":"The peculiar circumstances of journalist Michael Hastings' death in Los Angeles last week have unleashed Now there's another theory to contribute to the paranoia: According to a prominent security analyst, technology exists that could've allowed someone to ha…"},{"id":759,"headline":"The Men ‘Me Too’ Left Behind","short_description":"The movement toppled some alleged abusers, but others did just fine."},{"id":760,"headline":"Disgusted By Trump, These Teens Are Turning Instagram Political","short_description":"Alejandra Sosa and Cassidy Ward are some of the teens changing how we talk about politics."},{"id":761,"headline":"13 Things That Probably Sent Donald Trump Into A Rage Spiral In 2018","short_description":"Because the president has a notoriously bad temper."},{"id":762,"headline":"He Hawks Young Blood As A New Miracle Treatment. All That's Missing Is Proof.","short_description":"Jesse Karmazin claims he can fight aging, and a lot of people want to believe him."},{"id":763,"headline":"Mother Accused Of Hiding Daughter’s Diabetes Diagnosis As She Died","short_description":"An investigation by KSDK showed that the girl's Type I diabetes was diagnosed twice, and her mother was informed both times."},{"id":764,"headline":"Jeff Flake Won’t Rule Out 2020 Run: ‘Somebody Needs To’ Challenge Trump","short_description":"\"Like I said, I haven’t ruled it out,\" he said. \"I’m a long way from there, but somebody needs to and I think that the country needs to be reminded of what it means to be conservative.\""},{"id":765,"headline":"‘Apprentice’ Insiders Doubt Trump N-Word Tape Exists: ‘Would Have Leaked’","short_description":"“If there was a tape, it would have spread like wildfire,” said Jonathan Braun, who served as the show's supervising editor."},{"id":766,"headline":"Fox Commentator Bre Payton Dies After Sudden Illnesses","short_description":"The 26-year-old writer and broadcaster passed away Friday after being found unresponsive by a friend."},{"id":767,"headline":"Don Lemon Mocks Trump’s Shutdown Rage: Sounds Like ‘A Pouting Child’","short_description":"In his Friday night monologue, the CNN anchor called out the president's behavior as juvenile."},{"id":768,"headline":"Gaga Galvanizes Fans In Cyber Enigma Concert In Vegas Residency Debut","short_description":"Wild show mixes anime, outer space and PetGa."},{"id":769,"headline":"Shelter Goes Extra Mile To Reunite Owner And Dog A Year After He Was Stolen","short_description":"An animal shelter volunteer goes many extra miles to reunite a dog and his owner."},{"id":770,"headline":"Taxpayers Dish Out $54,000 For Mar-a-Lago Party Tents For New Year’s Eve","short_description":"The public eats the costs of a bash at Trump's Florida resort while federal workers go without pay amid the partial government shutdown."},{"id":771,"headline":"Trump's Threat To Close Border Is An 'Angry 8th-Grader's Tweet,' GOP Congressman Says","short_description":"“When you start throwing out vacuous threats like this, people stop taking you seriously,\" says Rep. Ryan Costello."},{"id":772,"headline":"Federal Personnel Office Suggests Furloughed Workers Trade Chores For Rent","short_description":"And \"consult your personal attorney\" for legal advice. Twitter erupts."},{"id":773,"headline":"Lauren McCluskey Sought Help Against A Dangerous Man. She Still Died.","short_description":"The University of Utah student called police repeatedly. Friends talked to college authorities. But nobody stopped her abuser."},{"id":774,"headline":"Usher Files For Divorce From Wife Grace Miguel","short_description":"Although the divorce comes after three women accused the singer last year of giving them herpes, it is unknown if that was a factor in the breakup."},{"id":775,"headline":"A Super Blood Wolf Moon Will Glow Red In The Sky This January","short_description":"The total lunar eclipse will be visible from coast to coast in the United States."},{"id":776,"headline":"Musicians Are Celebrating Making Barack Obama's 'Favorite Songs Of 2018' List","short_description":"Stars including Cardi B, Leon Bridges, Brandi Carlile and Janelle Monáe have publicly thanked the former president for the recognition."},{"id":777,"headline":"Netflix's ‘Black Mirror’ Choose-Your-Own-Adventure Movie Is Here And People Are Questioning Their Life Choices","short_description":"This might be the first-ever singular binge film."},{"id":778,"headline":"Kevin Spacey Asks To Skip Court Hearing On Sexual Assault Charges","short_description":"Spacey, charged with felony indecent assault, doesn't want to go to his arraignment hearing."},{"id":779,"headline":"Trump’s Dilemma: Go To Mar-a-Lago And Get Criticized? Or Disappoint Members?","short_description":"Members and guests at Trump’s for-profit club are shelling out as much as $1,270 each to mingle with him at his New Year’s Eve party."},{"id":780,"headline":"No, Melania Trump Did Not Just Go Pantsless","short_description":"Her pants and flats came off as an unfortunate optical illusion."},{"id":781,"headline":"No One Has Claimed That $1.5 Billion Lotto Jackpot, And The Clock Is Ticking","short_description":"The money will be returned to participating states if not claimed in time."},{"id":782,"headline":"Democrats Won’t Seat A North Carolina Republican Amid Election Fraud","short_description":"Democratic leaders announced Friday they won't seat Republican Mark Harris in the 9th District."},{"id":783,"headline":"Suspect In Officer's Murder Tried To Flee Back To Mexico, Police Say","short_description":"Gustavo Perez Arriaga was arrested Friday after allegedly shooting Cpl. Ronil Singh."},{"id":784,"headline":"Rep. Gohmert: Let Shutdown Run ‘Until Hell Freezes Over’ If Wall Isn’t Funded","short_description":"The GOP congressman suggested to \"Fox & Friends\" that building a border wall would be an act of \"compassion\" toward Mexico."},{"id":785,"headline":"A Non-Exhaustive List Of The Worst Men Of 2018","short_description":"This year was not a great look for men!"},{"id":786,"headline":"Netflix’s New Year’s Eve Countdown For Kids Is Back","short_description":"Parents can use Netflix's New Year's Eve countdowns that to make kids think it's midnight whenever they want."},{"id":787,"headline":"Maine Gov. Finally Certifies Election Result But Still Complains It Was ‘Stolen’","short_description":"In signing off on Democrat Jared Golden's victory, Maine's outgoing Republican governor took one last dig at the state's ranked-choice voting system."},{"id":788,"headline":"People Are Torn Over Whether Grover Dropped The F-Bomb On ‘Sesame Street’","short_description":"A clip circulating online has some debating the words that are coming out of the beloved puppet’s mouth."},{"id":789,"headline":"Emma Stone On Turning 30 And Doing Her First Nude Scene","short_description":"The \"Favourite\" actress said she got \"gloomy for about a week\" after the major milestone."},{"id":790,"headline":"WWII Vet Celebrates 96th Birthday By Doing The Floss","short_description":"You go, gramps!"},{"id":791,"headline":"Angela Bassett’s Tender Moment With The Star Of The Tina Turner Musical Is Joy","short_description":"A video of the \"What's Love Got To Do With It\" actress hugging Adrienne Warren has captured people's hearts."},{"id":792,"headline":"Most Facebook Users Don’t Trust The Site With Their Data","short_description":"Users distrusted the social media giant even before its latest controversies."},{"id":793,"headline":"The Most Famous Person To Die In 2018, According To Data Science","short_description":"By our definition, more celebrities died in 2018 than in any year since at least 2010."},{"id":794,"headline":"The Thinnest Skins In Media In 2018","short_description":"Their diapers runneth over."},{"id":795,"headline":"SWAT Standoff Ends After Negotiator Sings ‘White Christmas’ To Suspect","short_description":"Officials are calling the fact that no one was injured during the nine-hour standoff a \"Christmas miracle.\""},{"id":796,"headline":"The Government Shutdown Will Close The Smithsonian Museums After New Year’s","short_description":"It's just one way regular people will feel the effects of the shutdown."},{"id":797,"headline":"35 Funny Tweets About Parents' Winter Break Struggles","short_description":"\"It's called winter break because it breaks a parent's will to live.\""},{"id":798,"headline":"Trump’s EPA To Weaken Rule Limiting Coal Plant Mercury Emissions","short_description":"The Obama-era rule prevented coal-fired power plants from releasing mercury into the atmosphere."},{"id":799,"headline":"Lindsey Graham Vows To Nancy Pelosi, House Democrats: ‘No Wall Money, No Deal’","short_description":"The South Carolina senator continues to voice his support for President Trump's border wall amid the partial government shutdown."},{"id":800,"headline":"Former Walmart Santa Arrested After 2 Kids Found Buried in Backyard","short_description":"The suspect and three other adults have been charged with concealing the death of another person and cruelty to children in the first degree."},{"id":801,"headline":"Judge Calls For ‘Humanity’ In Asylum Ruling Amid Trump’s Immigration Crackdown","short_description":"A federal judge in New York appeared to call out the Trump administration when ruling on the prolonged detention of an asylum-seeker."},{"id":802,"headline":"School Bus Driver Who Went Viral Hopes His Act Of Kindness Will Inspire Others","short_description":"Curtis Jenkins bought Christmas gifts for every child on his elementary school bus route — and he's planning more kind gestures for the future."},{"id":803,"headline":"Serena Williams’ Glittery Sneakers Bring Sparkle To The Tennis Court","short_description":"✨These sneakers are a grand slam indeed.✨"},{"id":804,"headline":"No End To Government Shutdown In Sight As Trump Sticks With Border Wall Demand","short_description":"Trump is sticking with his demand for money to build a border wall with Mexico."},{"id":805,"headline":"Former General: Trump Made His Politicized Visit To Iraq All About Himself","short_description":"\"God, he's talking to special operations soldiers in Iraq. It's sort of embarrassing,\" former Gen. Barry McCaffrey told MSNBC."},{"id":806,"headline":"Angelina Jolie Doesn't Rule Out Running For Public Office","short_description":"The actress, director and humanitarian activist said, \"I’ll go where I’m needed\" but won't pursue it \"for now.\""},{"id":807,"headline":"Amos Oz, Israeli Author, Dead At 79","short_description":"He also an outspoken advocate of seeking peace with the Palestinians."},{"id":808,"headline":"Don Lemon: Trump’s 2013 Call For Obama To Be ‘Fired’ Over Shutdown ‘Priceless’","short_description":"The CNN host aired a Fox clip from 2013 where Trump said that the person to be fired “always has to be at the top.”"},{"id":809,"headline":"Funniest Animal Moments Of 2018","short_description":"These rebellious animals refused to be tamed. See for yourself."},{"id":810,"headline":"Barack Obama Shares His Favorite Books, Movies And Music Of 2018","short_description":"He made his annual list \"to highlight talented authors, artists, and storytellers – some who are household names and others who you may not have heard of before.”"},{"id":811,"headline":"Naomi Campbell Shares Photo Of Her Natural Hair In Cornrows: ‘Bare It All’","short_description":"The 48-year-old supermodel's followers went crazy over her cornrows."},{"id":812,"headline":"This Is What It’s Like To Watch Someone You Love Die From ALS","short_description":"In just 16 months, I lost my mom to an unspeakably savage disease with no cure."},{"id":813,"headline":"Transgender Inmate Gets Rare Transfer To Women's Prison After Legal Battle","short_description":"Deon “Strawberry” Hampton is serving a 10-year sentence for burglary in Illinois."},{"id":814,"headline":"Father Of Boy Who Died In U.S. Custody Heard Rumors They Could Cross Border","short_description":"After hearing the rumors, Agustin Gomez thought he should take advantage of “the opportunity” to fulfill his son’s dreams."},{"id":815,"headline":"Nicholas Sparks Message For Miley Cyrus, Liam Hemsworth Is Pure Romance","short_description":"The two met on the set of Sparks' movie, \"The Last Song.\""},{"id":816,"headline":"Miley Cyrus, Liam Hemsworth Gush Over Each Other After Secret Wedding","short_description":"Cyrus and Hemsworth, who met on the set of \"The Last Song,\" privately married this past weekend."},{"id":817,"headline":"Michael Cohen Denies Report Tying Him To Infamous Prague Trip","short_description":"According to McClatchy, Michael Cohen’s cell phone pinged towers near Prague in late summer 2016, suggesting he may have taken the trip he denies taking."},{"id":818,"headline":"2018 Proved Black Kids Read (And White Kids Read Books With Black Leads)","short_description":"The success of The Hate U Give was only the beginning."},{"id":819,"headline":"Deadly Hepatitis A Outbreaks Are Exposing Crumbling U.S. Public Health Infrastructure","short_description":"Over 10,000 people in the U.S. have contracted the preventable disease this year."},{"id":820,"headline":"These Are The Best Resolutions You Can Make, According To Therapists","short_description":"Start the new year with actually useful goals."},{"id":821,"headline":"Think Congress Was Bad This Year? Just Wait Till 2019.","short_description":"A prolonged stalemate over border wall funding doesn’t bode well for lawmakers’ task of raising the debt ceiling next year."},{"id":822,"headline":"Netflix Brings Back Countdowns To Fool Kids On New Year’s Eve","short_description":"The countdowns feature shows like “The Boss Baby: Back in Business” and “Fuller House.”"},{"id":823,"headline":"Stunning Celeb Beauty Looks To Inspire Your Holiday Party Makeup","short_description":"There's no better inspiration than a celebrity who's been made up by professionals."},{"id":824,"headline":"Incoming Head Of House Armed Services Committee Vows To Challenge Trump’s Lies","short_description":"Smith also said that his committee would oppose Trump’s push to create a new “Space Force” and increase the military budget by 5 percent."},{"id":825,"headline":"Hackers Steal Data Of Nearly 1,000 North Koreans Who Defected To South Korea","short_description":"“The malware was planted through emails sent by an internal address,” a ministry official told reporters."},{"id":826,"headline":"Trump Exposed Location, Faces Of Navy Seals Team In Iraq Tweet","short_description":"Critics say deployments of special operation forces — including Navy Seals — are almost always classified events."},{"id":827,"headline":"Power Plant Explosion Casts New Light On New York’s Dirty Fuel Addiction","short_description":"The bright-blue sky dazzled the city's residents, but the source of the light -- one of New York's dirtiest power plants -- could stoke an already heated debate."},{"id":828,"headline":"Nation’s Oldest World War II Veteran Dies At 112","short_description":"“Richard Overton made us proud to be Texans and proud to be Americans,” Texas Gov. Greg Abbott said."},{"id":829,"headline":"NYC Twitter Electrified By Blue Sky Transformer Explosion","short_description":"\"Friends in Queens, DM me re: your new superpowers.\""},{"id":830,"headline":"Forest Whitaker And Keisha Nash File For Divorce After 22 Years Of Marriage","short_description":"LOS ANGELES (AP) — Forest Whitaker has filed for divorce from his wife of 22 years, Keisha Nash-Whitaker.\n The 57-year-old \"Black Panther\" actor cite..."},{"id":831,"headline":"EPA Set To Run Out Of Money As Government Shutdown Drags On","short_description":"The Environmental Protection Agency had run on spare funding after the shutdown began. Now there are plans to furlough workers and prioritize high-risk projects."},{"id":832,"headline":"Blue Light Illuminates Sky In Queens As Explosion Rocks Con Edison Power Plant","short_description":"The dazzling light was caused by a transformer explosion at a New York City power plant."},{"id":833,"headline":"‘Nude Selfie’ Obtained In Mueller Inquiry, Says Filing By Indicted Russian Firm","short_description":"Court document by Concord Management asks how details about a \"nude selfie\" would threaten national security."},{"id":834,"headline":"Boy, 12, Survives Avalanche That Buried Him For 40 Minutes","short_description":"He was dragged at least 110 yards by the force of the avalanche."},{"id":835,"headline":"Chris Brown Charged With Two Counts — For Possessing A Monkey Without a Permit","short_description":"California fish and wildlife agents took the monkey away soon after Brown posted a photo of it on Instagram."},{"id":836,"headline":"Woman Spends 8 Years Searching For Couple Whose Proposal She Photographed","short_description":"A friend of the couple saw a story about the pics and contacted them immediately."},{"id":837,"headline":"‘Preposterous’: Federal Union Chief Slams Trump’s Comments About Dem Workers","short_description":"Trump insisted more Democrats are not getting paid; Randy Erwin said the president's reality twist would be \"comical\" but \"wasn't really funny at all.\""},{"id":838,"headline":"Shutdown Leaves Government Contractors Without Work And Likely No Back Pay","short_description":"While federal employees will likely get retroactively paid, many contractors will not."},{"id":839,"headline":"Montana Lawmaker Wants ‘Hippy Hippy Shake’ To Be State’s Official Rock Song","short_description":"The bill's introduction borrows from the song's lyrics in saying: \"WHEREAS, Montanans shake it to the left and shake it to the right and do everything wi..."},{"id":840,"headline":"Wait! Trump Actually Agrees With Obama On Something?","short_description":"The president said he \"totally agreed\" with a 2011 Obama tweet asking for comprehensive immigration reform."},{"id":841,"headline":"NASA's Close Encounter With Mysterious Space Object Will Make History On New Year's Day","short_description":"The New Horizons probe is hurtling toward an object nicknamed Ultima Thule in the mostly unexplored Kuiper Belt."},{"id":842,"headline":"Trump Got The Shutdown He Wanted But Doesn’t Seem To Have A Plan To End It","short_description":"With virtually no talks going on, House and Senate Republicans seem content to let the shutdown carry into next year, when Democrats take control of the ..."},{"id":843,"headline":"The Evolution Of Miley Cyrus","short_description":"From dropping mega-hit pop songs to marrying Liam Hemsworth, Cyrus shows that she can have the best of both worlds."},{"id":844,"headline":"2018: The Year In Ideas: A Review Of Ideas","short_description":"From the foremost thinkers of thoughts in America."},{"id":845,"headline":"The ‘Black Mirror’ Movie Trailer Is Here, And We’re Ready To Be Messed With","short_description":"There are rumors the film is going to be a choose-your-own-adventure-style story."},{"id":846,"headline":"Government Shutdown Likely To Stretch Into Next Week","short_description":"President Donald Trump is vowing to hold the line on his demand for money to build a border wall."},{"id":847,"headline":"Illinois Man Accused Of Throwing Dogs Off Balcony During Fight With Wife","short_description":"Jerald Jeske, a 51-year-old attorney from suburban Chicago, has been charged with felony aggravated cruelty to animals."},{"id":848,"headline":"Alex Jones’ Lawyer Violated Legal Ethics By Soliciting Porn Bribes.","short_description":"America’s foremost attorney for far-right extremists wanted “a little gravy,” then lied to cover it up. That’s just part of his twisted journey through a lax legal system."},{"id":849,"headline":"Accused Thief Made His Get-away On Stolen Front-End Loader","short_description":"Apparently, a Zamboni wasn't available."},{"id":850,"headline":"Puppy Rescued From Frozen Lake","short_description":"A police officer in Turkey broke through ice to rescue the pup."},{"id":851,"headline":"Ref Who Made Black Wrestler Cut His Hair Won’t Officiate Local Matches: Official","short_description":"The superintendent said Alan Maloney is “done working with our district.”"},{"id":852,"headline":"Boy Calls 911 To Gripe About Getting Snow Pants For Christmas","short_description":"911 is not a joke."},{"id":853,"headline":"Cities Turn To Artists For Creative Ideas To Make Streets Safer, Ease Traffic Jams","short_description":"Transportation planners also are hiring musicians and visual artists to tell stories about public spaces."},{"id":854,"headline":"The Shutdown Is The Latest Chapter In Trump’s Fight With Federal Workers","short_description":"He's been sticking it to them pretty much since he took office."},{"id":855,"headline":"Watch Adam Lambert Move Cher To Tears With Riveting 'Believe' Cover","short_description":"The Kennedy Center Honors tribute left the legendary singer-actress \"overwhelmed\" with emotion."},{"id":856,"headline":"Man Books 6 Flights To Spend Christmas With Flight Attendant Daughter","short_description":"Pierce Vaughan, a flight attendant for Delta Airlines, had to work on Dec. 24 and 25. So her father spent the holiday in the sky with her."},{"id":857,"headline":"Black Hotel Guest Making A Call In Lobby Accused of Loitering, Loses His Room","short_description":"Jermaine Massey, who filmed parts of the ordeal, says he was a victim of racial profiling in Oregon."},{"id":858,"headline":"Jemele Hill On Calling Trump A White Supremacist: Like ‘Saying Water Is Wet’","short_description":"\"I didn’t even think it was controversial,” the former ESPN host said."},{"id":859,"headline":"Jordan Peele’s ‘Us’ Trailer Has Song ‘I Got 5 On It’ And Twitter Has Feelings","short_description":"Using the song in a horror film \"has me [re-evaluating] everything I’ve ever known,\" one Twitter user wrote."},{"id":860,"headline":"Michelle Obama Named ‘Most Admired Woman’ In Annual Gallup Survey","short_description":"Former President Barack Obama was voted most admired man for the 11th consecutive year."},{"id":861,"headline":"Dominic West Says A Transgender James Bond Is ‘A Brilliant Idea’","short_description":"The \"Colette\" star even has a person in mind for the role."},{"id":862,"headline":"Alexandria Ocasio-Cortez Just Hung Her Office Plaque And Things Are Getting Real","short_description":"\"All for the Bronx and Queens,” she wrote on Instagram on Thursday."},{"id":863,"headline":"The Violence Against Women Act Just Expired","short_description":"The landmark legislation, which protects domestic violence and sexual assault survivors, expired on Friday amid the government shutdown."},{"id":864,"headline":"Instagram Accidentally Changed How You Scroll And People On Twitter Were Upset","short_description":"The social media platform said the update was \"supposed to be a very small test but we went broader than we anticipated.”"},{"id":865,"headline":"Kevin Hart Announces New Year’s Gig After Oscars Hosting Debacle","short_description":"The comedian will ring in 2019 in Las Vegas with rappers Lil Wayne and Big Sean."},{"id":866,"headline":"MSNBC Beats Fox News In Key Ratings For First Time In 17 Years","short_description":"President Donald Trump's favorite cable news network didn't draw in enough viewers to top MSNBC last week."},{"id":867,"headline":"Drake Is Totally Obsessed With His Son’s Sweet Christmas Gift","short_description":"The rapper confirmed he'd fathered a secret son earlier this year."},{"id":868,"headline":"How To Read A Champagne Bottle Label","short_description":"The perfect Champagne is necessary to finish off the year. Here’s how to pick the best one for you."},{"id":869,"headline":"Billie Lourd Pays Tribute To Mom Carrie Fisher In The Perfect Way","short_description":"The 26-year-old actress sang a song to her mother, who died in 2016 at the age of 60."},{"id":870,"headline":"From The Arctic’s Decline To The Green New Deal’s Rise: 3 Environmental Stories To Watch","short_description":"Climate change will grab headlines in 2019 as Alexandria Ocasio-Cortez pushes legislation, wildlife populations plummet, and ice melts at an alarming rate."},{"id":871,"headline":"Here’s How My Boyfriend And I Live In A New City Every Single Month","short_description":"Here's how I’ve been able to live in a new city almost every month, without blowing my savings account or putting an end to my career."},{"id":872,"headline":"Meghan Markle Hinted At Her Due Date On Christmas Day","short_description":"Prince Harry and the Duchess of Sussex are expecting their first child together."},{"id":873,"headline":"Indonesia Widens Danger Zone Around Anak Krakatau Volcano Following Tsunami","short_description":"The island volcano's alert status has been raised to the second-highest level after a tsunami killed at least 430 people."},{"id":874,"headline":"Opinion | The Scariest Thing For The GOP In 2018 Was Democrats’ New Blue Base","short_description":"Well, maybe the second scariest, behind their own leader."},{"id":875,"headline":"How To Start Having A Healthier And More Fulfilling Sex Life","short_description":"Experts explain why you may have low interest in sex and what you can do about it."},{"id":876,"headline":"How To Decode A Champagne Label And Buy A Better Bottle Of Bubbly","short_description":"What's better, premier cru or grand cru? And what does \"extra brut\" mean?"},{"id":877,"headline":"The Fab Five’s Fiercest Style Moments Of 2018","short_description":"This was the year of the (new) Fab Five."},{"id":878,"headline":"11 Relatable Parenting Quotes From Savannah Guthrie","short_description":"\"When you have a toddler, every hour is six hours,” said the \"Today\" co-anchor."},{"id":879,"headline":"Our 2018 Movie Superlatives","short_description":"An irreverent look back at a towering Oprah, a shape-shifting Tilda Swinton, a horny Christine Baranski and other details from the year in cinema."},{"id":880,"headline":"Retail Sector Enjoys Best Holiday Season In 6 Years As Shoppers Spend Up A Storm","short_description":"Consumers in the U.S. spent more than $850 billion between Nov. 1 and Dec. 24 this year, according to early retail data."},{"id":881,"headline":"Putin Says ‘Invulnerable’ New Hypersonic Nuclear Missile Is Ready For Deployment","short_description":"The weapon is impossible to intercept, the Russian leader boasted Wednesday."},{"id":882,"headline":"Macaulay Culkin Has A New Middle Name And It’s A Bit Repetitive","short_description":"We would have preferred Kevin McAllister."},{"id":883,"headline":"American Colin O’Brady Completes Historic Solo Trek Across Antarctica","short_description":"The 33-year-old from Oregon is the first person to cross the continent unaided."},{"id":884,"headline":"Michigan Officials Avoid Felony Charges By Pleading No Contest In Flint Water Scandal","short_description":"Stephen Busch and Michael Prysby, state environmental officials, agreed to testify against others in the Flint crisis."},{"id":885,"headline":"In A Possible U.S. First, No Violent Tornadoes Touched Down In 2018","short_description":"The U.S. is also on track to have the fewest tornado-related deaths in any year since record keeping began."},{"id":886,"headline":"Trump Brags To Troops About A Fictional Giant Pay Raise He Got Them","short_description":"The president told military personnel in Iraq that they'll get a raise of over 10 percent, their first in a decade. But it's 2.6 percent, and they get a hike every year."},{"id":887,"headline":"Iraqi Lawmakers Criticize Trump Visit As Blow To Iraqi Sovereignty","short_description":"Iraqi lawmakers told Reuters that Iraqi Prime Minister Adel Abdul Mahdi and Trump had disagreed over where their planned meeting should take place."},{"id":888,"headline":"Kirstjen Nielsen Faults ‘Those Who Seek Open Borders’ In Deaths of 2 Children","short_description":"Kirstjen Nielsen ordered an overhaul of medical screening procedures at the Mexican border after Felipe Gómez Alonzo, 8, died on Christmas Eve."},{"id":889,"headline":"Americans Trust Clergy Less Than Ever, Gallup Poll Finds","short_description":"Americans' confidence in religious leaders' honesty and ethical standards has been tanking in recent years."},{"id":890,"headline":"Opinion | Voters Can’t Let Democrats Cave In To Trump’s Wall Demands","short_description":"Even though Democrats have held firm, the pressure has to come from their voters, telling them they’d better not cave this time."},{"id":891,"headline":"‘Deportation Bus’ State Senator Michael Williams Turns Himself In To Jail","short_description":"Williams was indicted on charges including insurance fraud just before Christmas."},{"id":892,"headline":"Rob Delaney Describes First Christmas Without His Son In Heartbreaking Post","short_description":"“I speak publicly about Henry in an effort to destigmatize grief,” the comedian and “Catastrophe” star wrote of his 2-year-old son who died in January."},{"id":893,"headline":"Miley Cyrus And Liam Hemsworth Look Very Married In New Instagram Photos","short_description":"The two reportedly wed four days ago."},{"id":894,"headline":"Commercial Whaling Returns To Japan","short_description":"Japan has decided to leave the International Whaling Commission and resume commercial whaling."},{"id":895,"headline":"There’s Video Evidence In Sexual Assault Case Against Kevin Spacey","short_description":"The victim, who was 18 at the time, took Snapchat video of the assault, police say."},{"id":896,"headline":"People On Twitter Shred Study Claiming Millennials Are Deciding To Freelance","short_description":"\"'Deciding to freelance' is a strange way of saying 'being forced into job insecurity,'\" one person tweeted in response to the Fast Company piece."},{"id":897,"headline":"Twitter Users Suspect He Didn’t Visit Iraq Troops Out Of Generosity Of His Heart","short_description":"One person wondered if the White House locks could be changed while the president was out of town."},{"id":898,"headline":"Rob Kardashian Makes Rare Appearance With Daughter On Christmas","short_description":"He shares the 2-year-old child, Dream, with onetime fiancée Blac Chyna."},{"id":899,"headline":"Here’s What Americans Make Of The Partial Shutdown","short_description":"No one in Washington comes out looking great, but Democrats fare less badly."},{"id":900,"headline":"NYT: Podiatrist’s Daughters Say He Diagnosed Trump With Bone Spurs As A ‘Favor’","short_description":"The diagnosis allowed Donald Trump to get a medical exemption that allowed him to avoid the draft during the Vietnam War."},{"id":901,"headline":"Alleged Burglar Breaks Into House, Convinces Homeowner To Give Him A Ride","short_description":"The homeowner figured the drive home was the easiest way to get the strange man out of his house."},{"id":902,"headline":"Trump Visits Iraq, His First Trip To A Combat Zone In His Life","short_description":"The president who avoided service in Vietnam because of bone spurs had come under increasing criticism for nearly finishing his second year in office without traveling to Iraq or Afghanistan."},{"id":903,"headline":"Too-Real Video Sums Up Parenting Over Winter Break","short_description":"The funny ladies of What's Up Moms are already fed up with the holidays."},{"id":904,"headline":"Mormon Women Missionaries Now Allowed To Wear Pants Instead Of Skirts","short_description":"The Church of Jesus Christ of Latter-day Saints said this will help the missionaries stay warm, ride bikes, and protect themselves from mosquito-borne diseases."},{"id":905,"headline":"Gabrielle Union And Dwyane Wade’s First Xmas With Kaavia James In Family Photos","short_description":"“Merry Christmas! To everyone feeling alone, scared, unsafe, unsure, without hope ... hang on,\" the actress wrote on Instagram."},{"id":906,"headline":"Seth Rogen Made A Shocking Discovery About ‘Home Alone,’ And Fans Are Bummed","short_description":"“You deserved to find out in a better way than this,” the actor said after spilling the beans on Twitter."},{"id":907,"headline":"These Service Members Will Work Without Paychecks During The Government Shutdown","short_description":"The Coast Guard is the only military branch not getting its funding."},{"id":908,"headline":"‘All I Want For Christmas Is You’ Looks Like It Just Broke Another Record","short_description":"Mariah Carey's 24-year-old song ruled the streaming charts this week."},{"id":909,"headline":"Thousands Of Patients Warned Of Potential HIV, Hepatitis Exposure","short_description":"Patients who were treated at HealthPlus Surgery Center in New Jersey have been notified following infection control breaches."},{"id":910,"headline":"Lisa Murkowski Will Bring Back Bill To Help Abused Native Women","short_description":"Rep. Bob Goodlatte tanked Savanna's Act this year. But he won't be here in the new Congress -- and Murkowski will."},{"id":911,"headline":"Ocasio-Cortez Reminds People That ‘Christ’s Family Were Refugees, Too’","short_description":"Some critics on Twitter protested that Jesus was not a refugee after the representative-elect wished a merry Christmas to “refugee babies in mangers.”"},{"id":912,"headline":"Illinois Neighborhood Decorated In Rainbows After Family’s Pride Flag Is Stolen","short_description":"Casey Handal and Zadette Rosado say they've come to view the incident as a \"really good lesson\" for their two children."},{"id":913,"headline":"Meghan Markle’s Half-Sister Spent Christmas Attacking The Duchess","short_description":"Samantha Grant viciously referred to her estranged sister as \"heartless.\""},{"id":914,"headline":"We Have So Many Questions About Khloe Kardashian’s Thigh-High Plaid Boots","short_description":"Do you wear pants with them? Are they for day or night? What's the 411, Khloe?"},{"id":915,"headline":"Demi Lovato Celebrates Christmas Days After Slamming Tabloid Rumors","short_description":"She left rehab in November after being hospitalized for a reported drug overdose in July."},{"id":916,"headline":"Opinion | Larry Nassar’s Survivors Were 2018′s Real Life Superheroes","short_description":"How the year's most horrifying sports story became its most inspiring moment."},{"id":917,"headline":"Mike Huckabee On Backlash To Trump’s Santa Call: He Didn’t Boil The Girl’s Bunny","short_description":"While discussing the president's phone call with a 7-year-old girl, Huckabee referenced the 1987 erotic thriller \"Fatal Attraction,\" as you do."},{"id":918,"headline":"Queen Elizabeth’s Christmas Address Talks About Meghan Markle And Family","short_description":"She also said a lot of sweet things about being a grandmother."},{"id":919,"headline":"Save On Everlane's Day Boot During The 'Choose What You Pay' Event","short_description":"Get up to 50 percent off at Everlane"},{"id":920,"headline":"Getting Pregnant Is One Thing. Staying Pregnant Is Another.","short_description":"Sometimes infertility is a reflection of the health care system we put up with."},{"id":921,"headline":"Justice Ruth Bader Ginsburg Released From Hospital After Cancer Surgery","short_description":"The 85-year-old underwent surgery on Friday to remove two cancer growths from her lung."},{"id":922,"headline":"You Can’t Understand Gun Violence’s Brutal Reality Until Hearing It From Doctors","short_description":"The NRA tried to push doctors out of the gun debate. They responded with raw accounts from the front lines of the crisis."},{"id":923,"headline":"Amy Schumer Celebrates Christmas With Video Of Her Vomiting","short_description":"“And so this is Christmas,” the pregnant comedian jokingly captioned the post."},{"id":924,"headline":"Kris Jenner Got The Most Over-The-Top Gift For Christmas","short_description":"It's the perfect gift for the momager and \"Keeping Up With the Kardashians\" matriarch."},{"id":925,"headline":"Female Celebrities Stand Together","short_description":"2018 was the year of women speaking up."},{"id":926,"headline":"CBP Orders Medical Checks For Detained Children After Guatemalan Boy Dies","short_description":"The 8-year-old's death is the second while in U.S. custody this month."},{"id":927,"headline":"After Christmas, The Government Shutdown Is Just Getting Started","short_description":"Asked when the government would reopen fully, Trump said he couldn’t say."},{"id":928,"headline":"This Is What No One Tells You About Being Evicted","short_description":"The trauma of being poor, so poor that your home can be taken away, still lives with me."},{"id":929,"headline":"Opinion | 2018 Was The Year Donald Trump Declared Total War On Immigrants","short_description":"The year can be summed up in one word: fear."},{"id":930,"headline":"Don Jr. Mocked With Birthday Party Hosted By Alleged Ex","short_description":"Larry Flynt, publisher of Hustler magazine and tireless troll of President Donald Trump, will throw the soirée at his Las Vegas club on New Year’s Eve."},{"id":931,"headline":"Trump Is Fixated On MS-13. But He's Making It Harder For Its Victims To Get Asylum.","short_description":"She came to the United States to escape MS-13. Now she has to get approval to stay."},{"id":932,"headline":"All The Michelle Obama Looks You Missed In 2018","short_description":"The former FLOTUS has been serving some serious lewks this year."},{"id":933,"headline":"Shutdown Slashes Nearly All Federal Food Stamps Office Staff","short_description":"As of Wednesday morning, remaining employees dwindled down to a mere 5 percent."},{"id":934,"headline":"Trump Sends Christmas Wishes To ‘Even The Fake News Media’","short_description":"“I hope everyone, even the Fake News Media, is having a great Christmas!” the president tweeted."},{"id":935,"headline":"Japan To Launch Commercial Whaling Again After Withdrawing From IWC","short_description":"Nation's decision is bashed by environmentalists and Australia."},{"id":936,"headline":"Roseanne Barr Announces Pre-Election Visit To Israeli Parliament","short_description":"The actress called it a way to “further my own knowledge of Jewish and Israeli history,” vowing to speak out “against the insidious and anti-Semitic BDS movement.”"},{"id":937,"headline":"Trump Ditches Tradition, Passing Up Christmas Visits To Troops","short_description":"The commander in chief opted for digital holiday greetings, video conferencing with military members around the globe from the Oval Office."},{"id":938,"headline":"Pelosi Zaps Trump’s Latest Version Of His Border Wall As A ‘Beaded Curtain’","short_description":"She scoffs at president's morphing concrete barrier as she lashes him for \" fear mongering\" over immigrants."},{"id":939,"headline":"Mayim Bialik Doing Better After Revealing Sad Feelings On Christmas Eve","short_description":"On Christmas Eve, the \"Big Bang Theory\" star said she was \"not doing so well.\""},{"id":940,"headline":"Thailand Approves Medical Marijuana In Regional First","short_description":"“This is a New Year’s gift\" to the Thai people, a top lawmaker said of the vote."},{"id":941,"headline":"Twitter To Trump: No, Federal Workers Do NOT Want The Shutdown","short_description":"President insists government employees have told him: \"Stay out until you get the funding for the wall.\""},{"id":942,"headline":"People Beat Christmas Loneliness On Twitter at #JoinIn","short_description":"A virtual holiday gathering on social media eases the pain for many people who are alone."},{"id":943,"headline":"Girl’s Faith In Santa Unshaken After ‘Marginal’ Phone Call With Trump","short_description":"Fortunately, Collman Lloyd of South Carolina hadn't heard the word \"marginal\" before, so Santa lives on."},{"id":944,"headline":"2018 Was A Terrible Year For The Press","short_description":"From the death of Jamal Khashoggi to Donald Trump's attacks on journalists."},{"id":945,"headline":"Christmas Is Now A National Holiday In Iraq","short_description":"Merry Christmas to all Iraqis celebrating!"},{"id":946,"headline":"Trump Says Shutdown Will Continue As Long As Democrats Reject Border Wall","short_description":"“I can’t tell you when the government’s going to be open,\" Trump said."},{"id":947,"headline":"Indonesia Tsunami Death Toll Rises To 429","short_description":"Unlike other tsunamis that have hit disaster-prone Indonesia following large earthquakes, Saturday’s big waves blasted ashore at night without warning."},{"id":948,"headline":"U.S. Says 8-Year-Old Guatemalan Boy Has Died In Custody","short_description":"This is the second immigrant child to die in detention this month."},{"id":949,"headline":"GoFundMe Says Donors In Alleged Homeless Scam Refunded","short_description":"A Philadelphia homeless man and New Jersey couple allegedly scammed donors out of more than $400,000."},{"id":950,"headline":"Will Smith And Family Wear The Most Festive Christmas Outfits Ever","short_description":"Jada Pinkett Smith is responsible for all the holiday cheer, the actor said."},{"id":951,"headline":"Paul McCartney's Legendary Christmas Message Is Fab For All Of Us","short_description":"The 76-year-old rocker offers funny advice on excess — and it isn't let it be."},{"id":952,"headline":"Trump Couldn’t Even Say ‘Merry Christmas’ Without Whining About His Border Wall","short_description":"\"It's a disgrace what's happening in our country, but other than that, I wish everybody a very Merry Christmas,\" the president said."},{"id":953,"headline":"Hawk Trapped In NYC’s Penn Station Rescued On Christmas Eve","short_description":"Let's hope this hawk got to spend the holidays with his or her family."},{"id":954,"headline":"Doofus Cops Of ‘Reno 911!’ Reunite To Help You Survive Holidays With Family","short_description":"Lt. Jim Dangle and Deputy Trudy Wiegel are on the case in a segment to air during Comedy Central's New Year's Eve marathon of the show."},{"id":955,"headline":"Barack Obama’s Christmas Greeting Will Make Your Heart Melt","short_description":"The former president and self-proclaimed \"Santa Obama\" wrote a seasonal message for his followers."},{"id":956,"headline":"Jordan Peele Drops Bone-Chilling Trailer For New Horror Movie ‘Us’","short_description":"The \"Get Out\" director said he wanted to make something \"more firmly in the horror genre.\""},{"id":957,"headline":"Kendall Jenner Responds To Not Making The Kardashian Christmas Card","short_description":"The \"Keeping Up With the Kardashians\" star was very good-natured about it."},{"id":958,"headline":"Robin Thicke And April Love Geary Announce Their Engagement On Christmas Eve","short_description":"The \"Blurred Lines\" singer and the model have been together for more than four years."},{"id":959,"headline":"Duchesses Kate And Meghan Step Out Together Amid Reports Of Tension","short_description":"The royals attended a Christmas morning church service on Tuesday."},{"id":960,"headline":"UK Bans Pet Stores From Selling Puppies And Kittens","short_description":"People who want a kitten or puppy must go to an animal shelter, rescue group or directly to a breeder, instead of going to a third-party commercial retai..."},{"id":961,"headline":"Mayim Bialik Posts A Really Depressing Holiday Note","short_description":"\"I'm newly single and not doing so well,\" the \"Big Bang Theory\" actress wrote -- plus her cats have forced her out of her own bed."},{"id":962,"headline":"What It’s Like To Be Grieving During The Holidays","short_description":"Resilience means finding ways to honor my father while continuing on with life."},{"id":963,"headline":"31 Things We Forgot Happened This Year","short_description":"The Red Hen! Ben Affleck! All those local news anchors!"},{"id":964,"headline":"How To Be Palm Oil-Conscious This New Year","short_description":"Palm oil is in nearly every product you use, and it's destroying vast tracts of land. Here's how you can help."},{"id":965,"headline":"MSNBC Trolls Rudy Giuliani With Award For Comments On Mueller Investigation","short_description":"Two of the three contenders were President Donald Trump himself."},{"id":966,"headline":"Andy Cohen And His Dog Wacha Wait For Baby To Arrive In The Cutest Way","short_description":"Man and pooch \"patiently\" await a life-changing moment."},{"id":967,"headline":"Shutdown Takes The Twinkle Out Of National Christmas Tree","short_description":"Resolving the impasse seems unlikely before Thursday, when the House and Senate return."},{"id":968,"headline":"9 Popular New Year’s Resolutions, Rated By How Achievable They Are","short_description":"Therapists score New Year’s goals and offer tips on making them realistic."},{"id":969,"headline":"GOP Senator Says Shutdown Means Time To 'Hunker Down Like A Jackass In A Hailstorm'","short_description":"“This is my fifth shutdown,” Sen. Pat Roberts (R-Kan.) told CNN. “I’m beyond frustrated.\""},{"id":970,"headline":"Joe Scarborough Warns 'Rogue President' Spiraling Into 'Terminal Presidency'","short_description":"“This administration will not survive,\" he said in his Christmas Eve broadcast Monday."},{"id":971,"headline":"Baby Jesus Statue Returns To Church’s Nativity Scene Nearly 90 Years After Theft","short_description":"\"I felt it should be returned to the rightful owner.\""},{"id":972,"headline":"Mattis Shares Christmas Message Taped One Day Before Resignation","short_description":"\"To all you lads and lasses holding the line in 2018 on land, at sea or in the air, thanks for keeping the faith,\" he said."},{"id":973,"headline":"Trump: ‘Nothing new on the shutdown’ on Day 3 of closure","short_description":"“Nothing new. Nothing new on the shutdown. Nothing new. Except we need border security,” Trump told reporters at the White House"},{"id":974,"headline":"Trump Questions 7-Year-Old’s Belief In Santa, Calling It ‘Marginal’","short_description":"“Are you a still a believer in Santa? Because at 7, it’s marginal, right?” the president asked the boy calling NORAD."},{"id":975,"headline":"Mexico Governor, Ex-Governor Killed In Air Crash","short_description":"Puebla Gov. Martha Erika Alonso and ex-Gov. Rafael Moreno Valle were a husband-and-wife power couple."},{"id":976,"headline":"New DNA Test Ordered For Kevin Cooper, Convicted Of Quadruple Murder In 1983","short_description":"A New York Times columnist says Cooper was framed. Gov. Jerry Brown's order may prove that."},{"id":977,"headline":"UN Human Rights Expert Calls For Probe Into Migrant Girl’s Death In US Custody","short_description":"Jakelin Caal Maquin died in U.S. custody after a 2,000-mile journey from Guatemala with her father."},{"id":978,"headline":"U.S. Judge Orders North Korea To Pay $500M In Student Otto Warmbier’s Death","short_description":"The American college student was arrested and sentenced to 15 years of hard labor in North Korea in March 2016 on suspicion of stealing a propaganda poster."},{"id":979,"headline":"‘I Feel Like I’m Failing Them’: How Low-Income Parents Struggle During Holidays","short_description":"These families worry about lost wages if they take off and how to pay for child care if they work over the holidays."},{"id":980,"headline":"Ex-Disney Actor Stoney Westmoreland Charged With 6 Counts In Underage Sex Case","short_description":"The former Disney Channel actor acknowledged to police that he had sent nude photos, and knew the person he was speaking with said he was 13 years old."}]